[Survived] BlockStatement
src/oauth/oauth.middleware.ts:6:90
 import { prisma } from '../db';
 
 // 🔐 Validate Bearer access token
-export async function verifyAccessToken(req: Request, res: Response, next: NextFunction) {
-  const header = req.headers.authorization;
-
-  if (!header || !header.startsWith('Bearer ')) {
-    return res.status(401).json({ error: 'Missing Authorization header' });
-  }
-
-  const token = header.replace('Bearer ', '');
-  const valid = await validateAccessToken(token);
-
-  if (!valid) {
-    return res.status(401).json({ error: 'Invalid or expired token' });
-  }
-
-  (req as any).userId = valid.userId;
-  (req as any).clientId = valid.clientId;
-  (req as any).scope = valid.scope;
-
-  next();
-}
+export async function verifyAccessToken(req: Request, res: Response, next: NextFunction) {}
 
 // 🔐 Validate /authorize input

[Survived] BooleanLiteral
src/oauth/oauth.middleware.ts:9:18
 export async function verifyAccessToken(req: Request, res: Response, next: NextFunction) {
   const header = req.headers.authorization;
 
-  if (!header || !header.startsWith('Bearer ')) {
+  if (!header || header.startsWith('Bearer ')) {
     return res.status(401).json({ error: 'Missing Authorization header' });
   }

[Survived] MethodExpression
src/oauth/oauth.middleware.ts:9:19
 export async function verifyAccessToken(req: Request, res: Response, next: NextFunction) {
   const header = req.headers.authorization;
 
-  if (!header || !header.startsWith('Bearer ')) {
+  if (!header || !header.endsWith('Bearer ')) {
     return res.status(401).json({ error: 'Missing Authorization header' });
   }

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:17:33
   const valid = await validateAccessToken(token);
 
   if (!valid) {
-    return res.status(401).json({ error: 'Invalid or expired token' });
+    return res.status(401).json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.middleware.ts:32:42
   const { userId } = req.body;
 
   if (!userId) {
-    return res.status(400).json({ error: 'userId is required' });
+    return res.status(400).json({ error: "" });
   }
 

[Killed] EqualityOperator
src/oauth/oauth.middleware.ts:35:7
     return res.status(400).json({ error: 'userId is required' });
   }
 
-  if (typeof userId !== 'string') {
+  if (typeof userId === 'string') {
     return res.status(400).json({ error: 'userId must be a string' });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:35:7
     return res.status(400).json({ error: 'userId is required' });
   }
 
-  if (typeof userId !== 'string') {
+  if (true) {
     return res.status(400).json({ error: 'userId must be a string' });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:36:33
   }
 
   if (typeof userId !== 'string') {
-    return res.status(400).json({ error: 'userId must be a string' });
+    return res.status(400).json({});
   }
 

[Survived] BlockStatement
src/oauth/oauth.middleware.ts:39:29
     return res.status(400).json({ error: 'userId must be a string' });
   }
 
-  if (/^\d+$/.test(userId)) {
-    return res.status(400).json({ error: 'userId cannot be numeric' });
-  }
+  if (/^\d+$/.test(userId)) {}
 
   if (/[<>]/.test(userId)) {

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:40:33
   }
 
   if (/^\d+$/.test(userId)) {
-    return res.status(400).json({ error: 'userId cannot be numeric' });
+    return res.status(400).json({});
   }
 

[Survived] ConditionalExpression
src/oauth/oauth.middleware.ts:43:7
     return res.status(400).json({ error: 'userId cannot be numeric' });
   }
 
-  if (/[<>]/.test(userId)) {
+  if (false) {
     return res.status(400).json({ error: 'userId contains invalid characters' });
   }

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:44:33
   }
 
   if (/[<>]/.test(userId)) {
-    return res.status(400).json({ error: 'userId contains invalid characters' });
+    return res.status(400).json({});
   }
 

[Killed] Regex
src/oauth/oauth.middleware.ts:47:21
     return res.status(400).json({ error: 'userId contains invalid characters' });
   }
 
-  const uuidRegex = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
+  const uuidRegex = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[^0-9a-f]{12}$/i;
 
   if (!uuidRegex.test(userId)) {
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] Regex
src/oauth/oauth.middleware.ts:47:21
     return res.status(400).json({ error: 'userId contains invalid characters' });
   }
 
-  const uuidRegex = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
+  const uuidRegex = /^[0-9a-f]-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
 
   if (!uuidRegex.test(userId)) {
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/oauth/oauth.middleware.ts:65:80
 }
 
 // 🔐 Validate /token input
-export function validateToken(req: Request, res: Response, next: NextFunction) {
-  const { code } = req.body;
-
-  if (!code || typeof code !== 'string') {
-    return res.status(400).json({
-      error: 'authorization code is required and must be a string',
-    });
-  }
-
-  next();
-}
+export function validateToken(req: Request, res: Response, next: NextFunction) {}
 
killedBy: validateToken middleware returns 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BlockStatement
src/oauth/oauth.middleware.ts:68:42
 export function validateToken(req: Request, res: Response, next: NextFunction) {
   const { code } = req.body;
 
-  if (!code || typeof code !== 'string') {
-    return res.status(400).json({
-      error: 'authorization code is required and must be a string',
-    });
-  }
+  if (!code || typeof code !== 'string') {}
 
   next();
killedBy: validateToken middleware returns 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
src/oauth/oauth.middleware.ts:68:7
 export function validateToken(req: Request, res: Response, next: NextFunction) {
   const { code } = req.body;
 
-  if (!code || typeof code !== 'string') {
+  if (code || typeof code !== 'string') {
     return res.status(400).json({
       error: 'authorization code is required and must be a string',
killedBy: validateToken middleware calls next() if code is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
