[Survived] StringLiteral
src/jwt/jwt.controller.ts:17:26
       eventType: 'jwt.login',
       outcome: 'failure',
       ipAddress: req.ip,
-      userAgent: req.get('user-agent'),
+      userAgent: req.get(""),
       metadata: { email },
     });

[Survived] ObjectLiteral
src/jwt/jwt.controller.ts:18:17
       outcome: 'failure',
       ipAddress: req.ip,
       userAgent: req.get('user-agent'),
-      metadata: { email },
+      metadata: {},
     });
     return res.status(400).json({ error: 'Invalid credentials' });

[Survived] StringLiteral
src/jwt/jwt.controller.ts:20:42
       userAgent: req.get('user-agent'),
       metadata: { email },
     });
-    return res.status(400).json({ error: 'Invalid credentials' });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] BlockStatement
src/jwt/jwt.controller.ts:24:15
   }
 
   const valid = await isValidPassword(password, user.password);
-  if (!valid) {
-    await writeAuditEvent({
-      userId: user.id,
-      eventType: 'jwt.login',
-      outcome: 'failure',
-      ipAddress: req.ip,
-      userAgent: req.get('user-agent'),
-    });
-    return res.status(400).json({ error: 'Invalid credentials' });
-  }
+  if (!valid) {}
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);

[Survived] StringLiteral
src/jwt/jwt.controller.ts:27:18
   if (!valid) {
     await writeAuditEvent({
       userId: user.id,
-      eventType: 'jwt.login',
+      eventType: "",
       outcome: 'failure',
       ipAddress: req.ip,

[Survived] ObjectLiteral
src/jwt/jwt.controller.ts:32:33
       ipAddress: req.ip,
       userAgent: req.get('user-agent'),
     });
-    return res.status(400).json({ error: 'Invalid credentials' });
+    return res.status(400).json({});
   }
 

[Survived] BlockStatement
src/jwt/jwt.controller.ts:36:18
   }
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);
-  if (!mfaValid) {
-    await writeAuditEvent({
-      userId: user.id,
-      eventType: 'jwt.login',
-      outcome: 'failure',
-      ipAddress: req.ip,
-      userAgent: req.get('user-agent'),
-      metadata: { reason: 'mfa' },
-    });
-    return res.status(401).json({ error: 'MFA required or invalid code' });
-  }
+  if (!mfaValid) {}
 
   const token = generateJwt(user.id);

[Survived] StringLiteral
src/jwt/jwt.controller.ts:43:27
       outcome: 'failure',
       ipAddress: req.ip,
       userAgent: req.get('user-agent'),
-      metadata: { reason: 'mfa' },
+      metadata: { reason: "" },
     });
     return res.status(401).json({ error: 'MFA required or invalid code' });

[Survived] ObjectLiteral
src/jwt/jwt.controller.ts:56:31
     ipAddress: req.ip,
     userAgent: req.get('user-agent'),
   });
-  return res.status(200).json({ token });
+  return res.status(200).json({});
 }
 

[Survived] BlockStatement
src/jwt/jwt.controller.ts:59:65
   return res.status(200).json({ token });
 }
 
-export async function jwtProtected(req: Request, res: Response) {
-  return res.json({
-    message: 'JWT protected route accessed',
-    userId: (req as any).userId,
-  });
-}
+export async function jwtProtected(req: Request, res: Response) {}
 

[Survived] StringLiteral
src/jwt/jwt.controller.ts:61:14
 
 export async function jwtProtected(req: Request, res: Response) {
   return res.json({
-    message: 'JWT protected route accessed',
+    message: "",
     userId: (req as any).userId,
   });
