[Killed] BlockStatement
src/jwt/jwt.middleware.ts:13:7
 
   const token = header.split(' ')[1];
 
-  try {
-    const decoded = verifyJwt(token);
-
-    if (!decoded?.userId || typeof decoded.userId !== 'string') {
-      return res.status(401).json({ message: 'Invalid token' });
-    }
-
-    const expectedAudience = getJwtAudience();
-    const expectedIssuer = getJwtIssuer();
-
-    if (decoded.aud && decoded.aud !== expectedAudience) {
-      return res.status(401).json({ message: 'Invalid token' });
-    }
-
-    if (decoded.iss && decoded.iss !== expectedIssuer) {
-      return res.status(401).json({ message: 'Invalid token' });
-    }
-
-    (req as any).userId = decoded.userId;
-    return next();
-  } catch (err: any) {
+  try {} catch (err: any) {
     if (err?.name === 'TokenExpiredError') {
       return res.status(401).json({ message: 'Token expired' });
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] EqualityOperator
src/jwt/jwt.middleware.ts:16:29
   try {
     const decoded = verifyJwt(token);
 
-    if (!decoded?.userId || typeof decoded.userId !== 'string') {
+    if (!decoded?.userId || typeof decoded.userId === 'string') {
       return res.status(401).json({ message: 'Invalid token' });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.middleware.ts:16:9
   try {
     const decoded = verifyJwt(token);
 
-    if (!decoded?.userId || typeof decoded.userId !== 'string') {
+    if (true) {
       return res.status(401).json({ message: 'Invalid token' });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Survived] StringLiteral
src/jwt/jwt.middleware.ts:17:46
     const decoded = verifyJwt(token);
 
     if (!decoded?.userId || typeof decoded.userId !== 'string') {
-      return res.status(401).json({ message: 'Invalid token' });
+      return res.status(401).json({ message: "" });
     }
 

[Survived] ObjectLiteral
src/jwt/jwt.middleware.ts:24:35
     const expectedIssuer = getJwtIssuer();
 
     if (decoded.aud && decoded.aud !== expectedAudience) {
-      return res.status(401).json({ message: 'Invalid token' });
+      return res.status(401).json({});
     }
 

[Killed] BlockStatement
src/jwt/jwt.middleware.ts:33:22
 
     (req as any).userId = decoded.userId;
     return next();
-  } catch (err: any) {
-    if (err?.name === 'TokenExpiredError') {
-      return res.status(401).json({ message: 'Token expired' });
-    }
-
-    return res.status(401).json({ message: 'Invalid token' });
-  }
+  } catch (err: any) {}
 }
 
killedBy: JWT Middleware – Unit Tests Rejects request with invalid JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BlockStatement
src/jwt/jwt.middleware.ts:34:44
     (req as any).userId = decoded.userId;
     return next();
   } catch (err: any) {
-    if (err?.name === 'TokenExpiredError') {
-      return res.status(401).json({ message: 'Token expired' });
-    }
+    if (err?.name === 'TokenExpiredError') {}
 
     return res.status(401).json({ message: 'Invalid token' });
killedBy: JWT Middleware – Unit Tests Rejects request with expired JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "Invalid token",

[Killed] ConditionalExpression
src/jwt/jwt.middleware.ts:34:9
     (req as any).userId = decoded.userId;
     return next();
   } catch (err: any) {
-    if (err?.name === 'TokenExpiredError') {
+    if (false) {
       return res.status(401).json({ message: 'Token expired' });
     }
killedBy: JWT Middleware – Unit Tests Rejects request with expired JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "Invalid token",

[Killed] StringLiteral
src/jwt/jwt.middleware.ts:35:46
     return next();
   } catch (err: any) {
     if (err?.name === 'TokenExpiredError') {
-      return res.status(401).json({ message: 'Token expired' });
+      return res.status(401).json({ message: "" });
     }
 
killedBy: JWT Middleware – Unit Tests Rejects request with expired JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "",
