[Survived] StringLiteral
src/oauth/oauth.controller.ts:11:49
 import { matchesStoredHashOrValue } from '../auth/password';
 import { writeAuditEvent } from '../security/audit.service';
 
-const SUPPORTED_PKCE_METHODS = new Set(['S256', 'PLAIN']);
+const SUPPORTED_PKCE_METHODS = new Set(['S256', ""]);
 
 function getUserAgent(req: Request) {

[Killed] EqualityOperator
src/oauth/oauth.controller.ts:14:7
 const SUPPORTED_PKCE_METHODS = new Set(['S256', 'PLAIN']);
 
 function getUserAgent(req: Request) {
-  if (typeof req.get === 'function') {
+  if (typeof req.get !== 'function') {
     return req.get('user-agent');
   }
killedBy: token controller returns access token for valid code
statusReason: TypeError: req.get is not a function

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:14:7
 const SUPPORTED_PKCE_METHODS = new Set(['S256', 'PLAIN']);
 
 function getUserAgent(req: Request) {
-  if (typeof req.get === 'function') {
+  if (true) {
     return req.get('user-agent');
   }
killedBy: token controller returns access token for valid code
statusReason: TypeError: req.get is not a function

[Killed] OptionalChaining
src/oauth/oauth.controller.ts:18:18
     return req.get('user-agent');
   }
 
-  const header = req.headers?.['user-agent'];
+  const header = req.headers['user-agent'];
   return typeof header === 'string' ? header : undefined;
 }
killedBy: authorize controller returns code for valid user
statusReason: TypeError: Cannot read properties of undefined (reading 'user-agent')

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:19:10
   }
 
   const header = req.headers?.['user-agent'];
-  return typeof header === 'string' ? header : undefined;
+  return typeof header !== 'string' ? header : undefined;
 }
 

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:19:10
   }
 
   const header = req.headers?.['user-agent'];
-  return typeof header === 'string' ? header : undefined;
+  return true ? header : undefined;
 }
 

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:24:10
 
 function getRequestedRedirectUri(req: Request) {
   const redirectUri = req.body.redirectUri ?? req.body.redirect_uri;
-  return typeof redirectUri === 'string' ? redirectUri : undefined;
+  return typeof redirectUri !== 'string' ? redirectUri : undefined;
 }
 

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:24:10
 
 function getRequestedRedirectUri(req: Request) {
   const redirectUri = req.body.redirectUri ?? req.body.redirect_uri;
-  return typeof redirectUri === 'string' ? redirectUri : undefined;
+  return true ? redirectUri : undefined;
 }
 

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:46:20
   const variantOverrides = getVariantOverrides();
   const { userId, state, scope, code_challenge, code_challenge_method, redirectUri, redirect_uri } =
     req.body;
-  const clientId = req.body.clientId ?? req.body.client_id;
+  const clientId = req.body.clientId && req.body.client_id;
 
   if (!userId) {
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:57:33
   });
 
   if (!user) {
-    return res.status(400).json({ error: 'User not found' });
+    return res.status(400).json({});
   }
 

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:65:33
   });
 
   if (!client) {
-    return res.status(400).json({ error: 'Invalid clientId' });
+    return res.status(400).json({});
   }
 

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:76:5
   }
 
   if (
-    code_challenge_method &&
-    !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
+    code_challenge_method || !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
   ) {
     return res.status(400).json({
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:76:5
   }
 
   if (
-    code_challenge_method &&
-    !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
+    true
   ) {
     return res.status(400).json({
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:77:5
 
   if (
     code_challenge_method &&
-    !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
+    SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
   ) {
     return res.status(400).json({

[Survived] MethodExpression
src/oauth/oauth.controller.ts:77:33
 
   if (
     code_challenge_method &&
-    !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
+    !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toLowerCase())
   ) {
     return res.status(400).json({

[Survived] BlockStatement
src/oauth/oauth.controller.ts:78:5
   if (
     code_challenge_method &&
     !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())
-  ) {
-    return res.status(400).json({
-      error: 'invalid_request',
-      error_description: 'Unsupported code_challenge_method',
-    });
-  }
+  ) {}
 
   // ------------------------------------------------------

[Survived] StringLiteral
src/oauth/oauth.controller.ts:81:26
   ) {
     return res.status(400).json({
       error: 'invalid_request',
-      error_description: 'Unsupported code_challenge_method',
+      error_description: "",
     });
   }

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:88:38
   // ------------------------------------------------------
   // ⭐ SCOPE VALIDATION (NEW)
   // ------------------------------------------------------
-  const requestedScopes: string[] = (scope ?? 'read').split(' ');
+  const requestedScopes: string[] = (scope && 'read').split(' ');
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];

[Killed] BooleanLiteral
src/oauth/oauth.controller.ts:92:47
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];
 
-  const invalid = requestedScopes.some((s) => !allowedScopes.includes(s));
+  const invalid = requestedScopes.some((s) => allowedScopes.includes(s));
 
   if (invalid) {
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] MethodExpression
src/oauth/oauth.controller.ts:92:19
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];
 
-  const invalid = requestedScopes.some((s) => !allowedScopes.includes(s));
+  const invalid = requestedScopes.every(s => !allowedScopes.includes(s));
 
   if (invalid) {

[Survived] BlockStatement
src/oauth/oauth.controller.ts:94:16
 
   const invalid = requestedScopes.some((s) => !allowedScopes.includes(s));
 
-  if (invalid) {
-    return res.status(400).json({
-      error: 'invalid_scope',
-      error_description: `Client '${clientId}' is not allowed to request scope '${scope}'`,
-    });
-  }
+  if (invalid) {}
   // ------------------------------------------------------
 

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:95:33
   const invalid = requestedScopes.some((s) => !allowedScopes.includes(s));
 
   if (invalid) {
-    return res.status(400).json({
-      error: 'invalid_scope',
-      error_description: `Client '${clientId}' is not allowed to request scope '${scope}'`,
-    });
+    return res.status(400).json({});
   }
   // ------------------------------------------------------

[Survived] StringLiteral
src/oauth/oauth.controller.ts:96:14
 
   if (invalid) {
     return res.status(400).json({
-      error: 'invalid_scope',
+      error: "",
       error_description: `Client '${clientId}' is not allowed to request scope '${scope}'`,
     });

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:104:5
 
   const requestedRedirectUri = getRequestedRedirectUri(req);
   const hasConflictingRedirectValues =
-    redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
+    true;
 
   if (
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:104:64
 
   const requestedRedirectUri = getRequestedRedirectUri(req);
   const hasConflictingRedirectValues =
-    redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
+    redirectUri !== undefined && redirect_uri !== undefined && true;
 
   if (

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:107:5
     redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
 
   if (
-    (requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) ||
-    hasConflictingRedirectValues
+    true
   ) {
     return res.status(400).json({ error: 'Invalid redirect URI' });
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:107:6
     redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
 
   if (
-    (requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) ||
+    (requestedRedirectUri || !validateRedirectUri(requestedRedirectUri)) ||
     hasConflictingRedirectValues
   ) {

[Survived] BlockStatement
src/oauth/oauth.controller.ts:109:5
   if (
     (requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) ||
     hasConflictingRedirectValues
-  ) {
-    return res.status(400).json({ error: 'Invalid redirect URI' });
-  }
+  ) {}
 
   const code = crypto.randomUUID();

[Survived] StringLiteral
src/oauth/oauth.controller.ts:110:42
     (requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) ||
     hasConflictingRedirectValues
   ) {
-    return res.status(400).json({ error: 'Invalid redirect URI' });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:121:14
       userId,
       clientId,
       state: state ?? null,
-      scope: scope ?? 'read',
+      scope: scope && 'read',
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:122:40
       clientId,
       state: state ?? null,
       scope: scope ?? 'read',
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds / 1000),
       codeChallenge: code_challenge ?? null,
       codeChallengeMethod: code_challenge_method ?? null,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:122:27
       clientId,
       state: state ?? null,
       scope: scope ?? 'read',
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() - APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,
       codeChallengeMethod: code_challenge_method ?? null,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:135:34
     outcome: 'success',
     ipAddress: req.ip,
     userAgent: getUserAgent(req),
-    metadata: { clientId, scope: scope ?? 'read' },
+    metadata: { clientId, scope: scope && 'read' },
   });
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:135:43
     outcome: 'success',
     ipAddress: req.ip,
     userAgent: getUserAgent(req),
-    metadata: { clientId, scope: scope ?? 'read' },
+    metadata: { clientId, scope: scope ?? "" },
   });
 

[Survived] BlockStatement
src/oauth/oauth.controller.ts:156:35
   const auth = req.headers.authorization;
   let authenticatedClientId: string | undefined;
 
-  if (auth?.startsWith('Basic ')) {
-    const base64 = auth.replace('Basic ', '');
-    const [clientId, clientSecret] = Buffer.from(base64, 'base64').toString('utf8').split(':');
-
-    const client = await prisma.oAuthClient.findUnique({
-      where: { id: clientId },
-    });
-
-    if (!client || !(await matchesStoredHashOrValue(clientSecret, client.secret))) {
-      return res.status(401).json({
-        error: 'invalid_client',
-        error_description: 'Invalid client credentials',
-      });
-    }
-
-    authenticatedClientId = client.id;
-  }
+  if (auth?.startsWith('Basic ')) {}
 
   if (!code) {

[Survived] MethodExpression
src/oauth/oauth.controller.ts:156:7
   const auth = req.headers.authorization;
   let authenticatedClientId: string | undefined;
 
-  if (auth?.startsWith('Basic ')) {
+  if (auth?.endsWith('Basic ')) {
     const base64 = auth.replace('Basic ', '');
     const [clientId, clientSecret] = Buffer.from(base64, 'base64').toString('utf8').split(':');

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:175:33
   }
 
   if (!code) {
-    return res.status(400).json({ error: 'Missing code' });
+    return res.status(400).json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:175:42
   }
 
   if (!code) {
-    return res.status(400).json({ error: 'Missing code' });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:178:27
     return res.status(400).json({ error: 'Missing code' });
   }
 
-  if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
+  if (!requestClientId && authenticatedClientId && APP_CONFIG.isProduction) {
     return res.status(400).json({
       error: 'invalid_client',

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:178:7
     return res.status(400).json({ error: 'Missing code' });
   }
 
-  if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
+  if (true && APP_CONFIG.isProduction) {
     return res.status(400).json({
       error: 'invalid_client',

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:179:33
   }
 
   if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
-    return res.status(400).json({
-      error: 'invalid_client',
-      error_description: 'Missing client_id',
-    });
+    return res.status(400).json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:181:26
   if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
     return res.status(400).json({
       error: 'invalid_client',
-      error_description: 'Missing client_id',
+      error_description: "",
     });
   }

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:190:33
   });
 
   if (!stored) {
-    return res.status(400).json({ error: 'Invalid authorization code' });
+    return res.status(400).json({});
   }
 

[Survived] BlockStatement
src/oauth/oauth.controller.ts:193:20
     return res.status(400).json({ error: 'Invalid authorization code' });
   }
 
-  if (stored.used) {
-    return res.status(400).json({ error: 'Authorization code already used' });
-  }
+  if (stored.used) {}
 
   const validateState = variantOverrides.oauth?.validateState ?? true;

[Survived] StringLiteral
src/oauth/oauth.controller.ts:194:42
   }
 
   if (stored.used) {
-    return res.status(400).json({ error: 'Authorization code already used' });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:198:7
   }
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
-  if (validateState && stored.state && stored.state !== state) {
+  if (validateState && stored.state || stored.state !== state) {
     return res.status(400).json({ error: 'Invalid state' });
   }

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:199:33
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
   if (validateState && stored.state && stored.state !== state) {
-    return res.status(400).json({ error: 'Invalid state' });
+    return res.status(400).json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:199:42
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
   if (validateState && stored.state && stored.state !== state) {
-    return res.status(400).json({ error: 'Invalid state' });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:204:14
 
   if (authenticatedClientId && authenticatedClientId !== stored.clientId) {
     return res.status(401).json({
-      error: 'invalid_client',
+      error: "",
       error_description: 'Client does not match authorization code',
     });

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:209:26
     });
   }
 
-  if (requestClientId && requestClientId !== stored.clientId) {
+  if (requestClientId && true) {
     return res.status(401).json({
       error: 'invalid_client',

[Survived] BlockStatement
src/oauth/oauth.controller.ts:217:29
   }
 
   // PKCE verification (only if a challenge was stored)
-  if (stored.codeChallenge) {
-    if (!codeVerifier) {
-      return res.status(400).json({
-        error: 'invalid_request',
-        error_description: 'Missing code_verifier',
-      });
-    }
-
-    const method = (stored.codeChallengeMethod ?? 'plain').toUpperCase();
-    const computedChallenge =
-      method === 'S256'
-        ? crypto.createHash('sha256').update(codeVerifier).digest('base64url')
-        : codeVerifier;
-
-    if (computedChallenge !== stored.codeChallenge) {
-      return res.status(400).json({
-        error: 'invalid_grant',
-        error_description: 'PKCE verification failed',
-      });
-    }
-  }
+  if (stored.codeChallenge) {}
 
   const tokenResult = await exchangeCodeForToken(code);

[Survived] BlockStatement
src/oauth/oauth.controller.ts:218:24
 
   // PKCE verification (only if a challenge was stored)
   if (stored.codeChallenge) {
-    if (!codeVerifier) {
-      return res.status(400).json({
-        error: 'invalid_request',
-        error_description: 'Missing code_verifier',
-      });
-    }
+    if (!codeVerifier) {}
 
     const method = (stored.codeChallengeMethod ?? 'plain').toUpperCase();

[Survived] StringLiteral
src/oauth/oauth.controller.ts:220:16
   if (stored.codeChallenge) {
     if (!codeVerifier) {
       return res.status(400).json({
-        error: 'invalid_request',
+        error: "",
         error_description: 'Missing code_verifier',
       });

[Survived] MethodExpression
src/oauth/oauth.controller.ts:225:20
       });
     }
 
-    const method = (stored.codeChallengeMethod ?? 'plain').toUpperCase();
+    const method = (stored.codeChallengeMethod ?? 'plain').toLowerCase();
     const computedChallenge =
       method === 'S256'

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:227:7
 
     const method = (stored.codeChallengeMethod ?? 'plain').toUpperCase();
     const computedChallenge =
-      method === 'S256'
+      method !== 'S256'
         ? crypto.createHash('sha256').update(codeVerifier).digest('base64url')
         : codeVerifier;

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:227:7
 
     const method = (stored.codeChallengeMethod ?? 'plain').toUpperCase();
     const computedChallenge =
-      method === 'S256'
+      true
         ? crypto.createHash('sha256').update(codeVerifier).digest('base64url')
         : codeVerifier;

[Survived] BlockStatement
src/oauth/oauth.controller.ts:231:53
         ? crypto.createHash('sha256').update(codeVerifier).digest('base64url')
         : codeVerifier;
 
-    if (computedChallenge !== stored.codeChallenge) {
-      return res.status(400).json({
-        error: 'invalid_grant',
-        error_description: 'PKCE verification failed',
-      });
-    }
+    if (computedChallenge !== stored.codeChallenge) {}
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:233:16
 
     if (computedChallenge !== stored.codeChallenge) {
       return res.status(400).json({
-        error: 'invalid_grant',
+        error: "",
         error_description: 'PKCE verification failed',
       });

[Survived] StringLiteral
src/oauth/oauth.controller.ts:234:28
     if (computedChallenge !== stored.codeChallenge) {
       return res.status(400).json({
         error: 'invalid_grant',
-        error_description: 'PKCE verification failed',
+        error_description: "",
       });
     }

[Killed] ObjectLiteral
src/oauth/oauth.controller.ts:254:31
     metadata: { clientId: stored.clientId },
   });
 
-  return res.status(200).json({
-    access_token: tokenResult.accessToken,
-    refresh_token: tokenResult.refreshToken,
-    token_type: 'Bearer',
-    expires_in: 3600,
-  });
+  return res.status(200).json({});
 }
 
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "access_token": "jwt-token",
-   "expires_in": 3600,

[Killed] StringLiteral
src/oauth/oauth.controller.ts:257:17
   return res.status(200).json({
     access_token: tokenResult.accessToken,
     refresh_token: tokenResult.refreshToken,
-    token_type: 'Bearer',
+    token_type: "",
     expires_in: 3600,
   });
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "access_token": "jwt-token",
    "expires_in": 3600,

[Survived] BlockStatement
src/oauth/oauth.controller.ts:269:22
   const refreshToken = req.body.refresh_token ?? req.body.refreshToken;
   const clientId = req.body.clientId ?? req.body.client_id;
 
-  if (!refreshToken) {
-    return res.status(400).json({
-      error: 'invalid_request',
-      error_description: 'Missing refresh_token',
-    });
-  }
+  if (!refreshToken) {}
 
   const newAccessToken = crypto.randomUUID();

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:270:33
   const clientId = req.body.clientId ?? req.body.client_id;
 
   if (!refreshToken) {
-    return res.status(400).json({
-      error: 'invalid_request',
-      error_description: 'Missing refresh_token',
-    });
+    return res.status(400).json({});
   }
 

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:284:11
       refreshToken: hashOpaqueToken(refreshToken),
       clientId,
     },
-    data: {
-      accessToken: hashOpaqueToken(newAccessToken),
-      refreshToken: hashOpaqueToken(newRefreshToken),
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
-    },
+    data: {},
   });
 

[Survived] BlockStatement
src/oauth/oauth.controller.ts:291:28
     },
   });
 
-  if (rotated.count !== 1) {
-    return res.status(400).json({
-      error: 'invalid_grant',
-      error_description: 'Invalid refresh token',
-    });
-  }
+  if (rotated.count !== 1) {}
 
   return res.json({

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:298:19
     });
   }
 
-  return res.json({
-    access_token: newAccessToken,
-    refresh_token: newRefreshToken,
-    token_type: 'Bearer',
-    expires_in: 3600,
-  });
+  return res.json({});
 }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:301:17
   return res.json({
     access_token: newAccessToken,
     refresh_token: newRefreshToken,
-    token_type: 'Bearer',
+    token_type: "",
     expires_in: 3600,
   });

[Survived] BlockStatement
src/oauth/oauth.controller.ts:312:15
 export async function revoke(req: Request, res: Response) {
   const { token } = req.body;
 
-  if (!token) {
-    return res.status(400).json({
-      error: 'invalid_request',
-      error_description: 'Missing token',
-    });
-  }
+  if (!token) {}
 
   const access = await prisma.oAuthAccessToken.findUnique({

[Survived] StringLiteral
src/oauth/oauth.controller.ts:315:26
   if (!token) {
     return res.status(400).json({
       error: 'invalid_request',
-      error_description: 'Missing token',
+      error_description: "",
     });
   }

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:332:7
     where: { refreshToken: hashOpaqueToken(token) },
   });
 
-  if (refresh) {
+  if (true) {
     await prisma.oAuthAccessToken.delete({ where: { refreshToken: hashOpaqueToken(token) } });
     return res.status(200).send();

[Survived] BlockStatement
src/oauth/oauth.controller.ts:346:15
 export async function introspect(req: Request, res: Response) {
   const { token } = req.body;
 
-  if (!token) {
-    return res.status(400).json({
-      active: false,
-      error: 'invalid_request',
-      error_description: 'Missing token',
-    });
-  }
+  if (!token) {}
 
   const access = await prisma.oAuthAccessToken.findUnique({

[Survived] BlockStatement
src/oauth/oauth.controller.ts:358:15
     where: { accessToken: hashOpaqueToken(token) },
   });
 
-  if (access) {
-    const now = new Date();
-    const active = access.expiresAt > now;
-
-    return res.json({
-      active,
-      scope: access.scope ?? null,
-      client_id: access.clientId,
-      user_id: access.userId,
-      exp: Math.floor(access.expiresAt.getTime() / 1000),
-      token_type: 'access_token',
-    });
-  }
+  if (access) {}
 
   const refresh = await prisma.oAuthAccessToken.findUnique({

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:360:20
 
   if (access) {
     const now = new Date();
-    const active = access.expiresAt > now;
+    const active = false;
 
     return res.json({

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:360:20
 
   if (access) {
     const now = new Date();
-    const active = access.expiresAt > now;
+    const active = access.expiresAt >= now;
 
     return res.json({

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:362:21
     const now = new Date();
     const active = access.expiresAt > now;
 
-    return res.json({
-      active,
-      scope: access.scope ?? null,
-      client_id: access.clientId,
-      user_id: access.userId,
-      exp: Math.floor(access.expiresAt.getTime() / 1000),
-      token_type: 'access_token',
-    });
+    return res.json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:368:19
       client_id: access.clientId,
       user_id: access.userId,
       exp: Math.floor(access.expiresAt.getTime() / 1000),
-      token_type: 'access_token',
+      token_type: "",
     });
   }

[Survived] BlockStatement
src/oauth/oauth.controller.ts:376:16
     where: { refreshToken: token },
   });
 
-  if (refresh) {
-    const now = new Date();
-    const active = refresh.expiresAt > now;
-
-    return res.json({
-      active,
-      scope: refresh.scope ?? null,
-      client_id: refresh.clientId,
-      user_id: refresh.userId,
-      exp: Math.floor(refresh.expiresAt.getTime() / 1000),
-      token_type: 'refresh_token',
-    });
-  }
+  if (refresh) {}
 
   return res.json({ active: false });

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:378:20
 
   if (refresh) {
     const now = new Date();
-    const active = refresh.expiresAt > now;
+    const active = true;
 
     return res.json({

[Survived] StringLiteral
src/oauth/oauth.controller.ts:386:19
       client_id: refresh.clientId,
       user_id: refresh.userId,
       exp: Math.floor(refresh.expiresAt.getTime() / 1000),
-      token_type: 'refresh_token',
+      token_type: "",
     });
   }
