[Killed] ArithmeticOperator
src/sessions/session.service.ts:7:40
   return prisma.session.create({
     data: {
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24), // 24 hours
+      expiresAt: new Date(Date.now() + 1000 / 60 * 60 * 24), // 24 hours
     },
   });
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.user.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\tests\sessions\unit\session.middleware.test.ts:11:23

   8 beforeEach(async () => {
   9   await resetDatabase();
  10 
→ 11   await prisma.user.create(

[Killed] ArithmeticOperator
src/sessions/session.service.ts:19:27
     data: {
       id: sessionId,
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24),
+      expiresAt: new Date(Date.now() - 1000 * 60 * 60 * 24),
     },
   });
killedBy: Session Middleware – Unit Tests Rejects invalid session
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.user.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\tests\sessions\unit\session.middleware.test.ts:11:23

   8 beforeEach(async () => {
   9   await resetDatabase();
  10 
→ 11   await prisma.user.create(
