[Killed] BlockStatement
src/sessions/sessions.middleware.ts:4:87
 import { Request, Response, NextFunction } from 'express';
 import { findSession } from './session.service';
 
-export async function requireSession(req: Request, res: Response, next: NextFunction) {
-  const sessionId = req.cookies.sessionId;
-
-  if (!sessionId) {
-    return res.status(401).json({ message: 'No session cookie' });
-  }
-
-  const session = await findSession(sessionId);
-
-  if (!session) {
-    return res.status(401).json({ message: 'Invalid session' });
-  }
-
-  // expiry check
-  if (session.expiresAt && session.expiresAt < new Date()) {
-    return res.status(401).json({ message: 'Session expired' });
-  }
-
-  // Attach userId to request
-  (req as any).userId = session.userId;
-
-  next();
-}
+export async function requireSession(req: Request, res: Response, next: NextFunction) {}
 
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BlockStatement
src/sessions/sessions.middleware.ts:7:19
 export async function requireSession(req: Request, res: Response, next: NextFunction) {
   const sessionId = req.cookies.sessionId;
 
-  if (!sessionId) {
-    return res.status(401).json({ message: 'No session cookie' });
-  }
+  if (!sessionId) {}
 
   const session = await findSession(sessionId);
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: PrismaClientValidationError: 
Invalid `prisma.session.findUnique()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\src\sessions\session.service.ts:98:27

  95   {}
  96 } else {
  97   stryCov_9fa48("721");
→ 98   return prisma.session.findUnique({

[Killed] ObjectLiteral
src/sessions/sessions.middleware.ts:14:33
   const session = await findSession(sessionId);
 
   if (!session) {
-    return res.status(401).json({ message: 'Invalid session' });
+    return res.status(401).json({});
   }
 
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.user.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\tests\sessions\unit\session.middleware.test.ts:11:23

   8 beforeEach(async () => {
   9   await resetDatabase();
  10 
→ 11   await prisma.user.create(

[Killed] StringLiteral
src/sessions/sessions.middleware.ts:14:44
   const session = await findSession(sessionId);
 
   if (!session) {
-    return res.status(401).json({ message: 'Invalid session' });
+    return res.status(401).json({ message: "" });
   }
 
killedBy: Session Middleware – Unit Tests Rejects invalid session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Invalid session",
+   "message": "",
