[Survived] StringLiteral
src/sessions/sessions.controller.ts:22:20
     const user = await findUserByEmail(email);
     if (!user) {
       await writeAuditEvent({
-        eventType: 'session.login',
+        eventType: "",
         outcome: 'failure',
         ipAddress: req.ip,

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:28:35
         userAgent: req.get('user-agent'),
         metadata: { email },
       });
-      return res.status(401).json({ message: 'Invalid credentials' });
+      return res.status(401).json({});
     }
 

[Survived] StringLiteral
src/sessions/sessions.controller.ts:28:46
         userAgent: req.get('user-agent'),
         metadata: { email },
       });
-      return res.status(401).json({ message: 'Invalid credentials' });
+      return res.status(401).json({ message: "" });
     }
 

[Survived] BlockStatement
src/sessions/sessions.controller.ts:32:17
     }
 
     const match = await isValidPassword(password, user.password);
-    if (!match) {
-      await writeAuditEvent({
-        userId: user.id,
-        eventType: 'session.login',
-        outcome: 'failure',
-        ipAddress: req.ip,
-        userAgent: req.get('user-agent'),
-      });
-      return res.status(401).json({ message: 'Invalid credentials' });
-    }
+    if (!match) {}
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);

[Survived] BlockStatement
src/sessions/sessions.controller.ts:44:20
     }
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);
-    if (!mfaValid) {
-      await writeAuditEvent({
-        userId: user.id,
-        eventType: 'session.login',
-        outcome: 'failure',
-        ipAddress: req.ip,
-        userAgent: req.get('user-agent'),
-        metadata: { reason: 'mfa' },
-      });
-      return res.status(401).json({ message: 'MFA required or invalid code' });
-    }
+    if (!mfaValid) {}
 
     const existingSessionId = req.cookies?.sessionId;

[Survived] ConditionalExpression
src/sessions/sessions.controller.ts:57:9
     }
 
     const existingSessionId = req.cookies?.sessionId;
-    if (existingSessionId && regenerateOnLogin) {
+    if (false) {
       await deleteSession(existingSessionId).catch(() => undefined);
     }

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:62:7
     }
 
     const session =
-      existingSessionId && !regenerateOnLogin
+      existingSessionId || !regenerateOnLogin
         ? await createSessionWithId(user.id, existingSessionId)
         : await createSession(user.id);

[Survived] BooleanLiteral
src/sessions/sessions.controller.ts:62:28
     }
 
     const session =
-      existingSessionId && !regenerateOnLogin
+      existingSessionId && regenerateOnLogin
         ? await createSessionWithId(user.id, existingSessionId)
         : await createSession(user.id);

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:66:41
         ? await createSessionWithId(user.id, existingSessionId)
         : await createSession(user.id);
 
-    res.cookie('sessionId', session.id, {
-      httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
-      secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,
-      sameSite: sessionCookieOverride?.sameSite ?? APP_CONFIG.cookie.sameSite,
-      domain: APP_CONFIG.cookie.domain,
-      maxAge: APP_CONFIG.cookie.maxAgeMs,
-    });
+    res.cookie('sessionId', session.id, {});
 
     await writeAuditEvent({

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:67:17
         : await createSession(user.id);
 
     res.cookie('sessionId', session.id, {
-      httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
+      httpOnly: sessionCookieOverride?.httpOnly && APP_CONFIG.cookie.httpOnly,
       secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,
       sameSite: sessionCookieOverride?.sameSite ?? APP_CONFIG.cookie.sameSite,

[Survived] BlockStatement
src/sessions/sessions.controller.ts:91:66
   }
 }
 
-export async function logoutSession(req: Request, res: Response) {
-  const variantOverrides = getVariantOverrides();
-  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
-  const sessionId = req.cookies.sessionId;
-
-  if (sessionId && invalidateSessionOnLogout) {
-    await deleteSession(sessionId); // delete from DB
-  }
-
-  res.clearCookie('sessionId', {
-    httpOnly: APP_CONFIG.cookie.httpOnly,
-    secure: APP_CONFIG.cookie.secure,
-    sameSite: APP_CONFIG.cookie.sameSite,
-    domain: APP_CONFIG.cookie.domain,
-  }); // remove cookie
-
-  await writeAuditEvent({
-    eventType: 'session.logout',
-    outcome: 'success',
-    ipAddress: req.ip,
-    userAgent: req.get('user-agent'),
-  });
-
-  return res.json({ message: 'Logged out' });
-}
+export async function logoutSession(req: Request, res: Response) {}
 
 export function getSessionProtected(req: Request, res: Response) {

[Survived] ConditionalExpression
src/sessions/sessions.controller.ts:96:7
   const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
   const sessionId = req.cookies.sessionId;
 
-  if (sessionId && invalidateSessionOnLogout) {
+  if (false) {
     await deleteSession(sessionId); // delete from DB
   }

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:96:7
   const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
   const sessionId = req.cookies.sessionId;
 
-  if (sessionId && invalidateSessionOnLogout) {
+  if (sessionId || invalidateSessionOnLogout) {
     await deleteSession(sessionId); // delete from DB
   }

[Survived] StringLiteral
src/sessions/sessions.controller.ts:100:19
     await deleteSession(sessionId); // delete from DB
   }
 
-  res.clearCookie('sessionId', {
+  res.clearCookie("", {
     httpOnly: APP_CONFIG.cookie.httpOnly,
     secure: APP_CONFIG.cookie.secure,

[Survived] StringLiteral
src/sessions/sessions.controller.ts:114:30
     userAgent: req.get('user-agent'),
   });
 
-  return res.json({ message: 'Logged out' });
+  return res.json({ message: "" });
 }
 

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:114:19
     userAgent: req.get('user-agent'),
   });
 
-  return res.json({ message: 'Logged out' });
+  return res.json({});
 }
 

[Survived] BlockStatement
src/sessions/sessions.controller.ts:117:66
   return res.json({ message: 'Logged out' });
 }
 
-export function getSessionProtected(req: Request, res: Response) {
-  return res.json({
-    message: 'Protected route accessed',
-    userId: (req as any).userId, // set by requireSession middleware
-  });
-}
+export function getSessionProtected(req: Request, res: Response) {}
 

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:118:19
 }
 
 export function getSessionProtected(req: Request, res: Response) {
-  return res.json({
-    message: 'Protected route accessed',
-    userId: (req as any).userId, // set by requireSession middleware
-  });
+  return res.json({});
 }
 
