[Survived] BlockStatement
src/jwt/jwt.keys.ts:36:23
     return privateKeyPem;
   }
 
-  if (privateKeyPath) {
-    return fs.readFileSync(privateKeyPath, 'utf8');
-  }
+  if (privateKeyPath) {}
 
   return getGeneratedKeyPair().privateKey;

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:62:7
 }
 
 export function getJwtAlgorithm(variantAlgorithm?: Algorithm | 'none'): SupportedJwtAlgorithm {
-  if (variantAlgorithm) {
+  if (true) {
     return variantAlgorithm as SupportedJwtAlgorithm;
   }
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Survived] ConditionalExpression
src/jwt/jwt.keys.ts:62:7
 }
 
 export function getJwtAlgorithm(variantAlgorithm?: Algorithm | 'none'): SupportedJwtAlgorithm {
-  if (variantAlgorithm) {
+  if (false) {
     return variantAlgorithm as SupportedJwtAlgorithm;
   }

[Survived] ConditionalExpression
src/jwt/jwt.keys.ts:66:7
     return variantAlgorithm as SupportedJwtAlgorithm;
   }
 
-  if (process.env.JWT_ALGORITHM) {
+  if (false) {
     return process.env.JWT_ALGORITHM as SupportedJwtAlgorithm;
   }

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:71:5
   }
 
   if (
-    process.env.JWT_PRIVATE_KEY_PEM ||
-    process.env.JWT_PRIVATE_KEY_PATH ||
-    process.env.JWT_PUBLIC_KEYS_JSON ||
-    APP_CONFIG.jwt.privateKeyPem ||
-    APP_CONFIG.jwt.privateKeyPath ||
-    APP_CONFIG.jwt.publicKeysJson
+    true
   ) {
     return 'RS256';
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid algorithm

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:71:5
   }
 
   if (
-    process.env.JWT_PRIVATE_KEY_PEM ||
-    process.env.JWT_PRIVATE_KEY_PATH ||
+    process.env.JWT_PRIVATE_KEY_PEM && process.env.JWT_PRIVATE_KEY_PATH ||
     process.env.JWT_PUBLIC_KEYS_JSON ||
     APP_CONFIG.jwt.privateKeyPem ||

[Survived] BlockStatement
src/jwt/jwt.keys.ts:77:5
     APP_CONFIG.jwt.privateKeyPem ||
     APP_CONFIG.jwt.privateKeyPath ||
     APP_CONFIG.jwt.publicKeysJson
-  ) {
-    return 'RS256';
-  }
+  ) {}
 
   if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {

[Killed] BlockStatement
src/jwt/jwt.keys.ts:81:62
     return 'RS256';
   }
 
-  if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {
-    return 'HS256';
-  }
+  if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {}
 
   return 'RS256';
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid algorithm

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:91:7
 export function getJwtSignContext(variantAlgorithm?: Algorithm | 'none') {
   const algorithm = getJwtAlgorithm(variantAlgorithm) as SupportedJwtAlgorithm;
 
-  if (algorithm === 'none') {
+  if (true) {
     return {
       algorithm,
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must have a value

[Survived] BlockStatement
src/jwt/jwt.keys.ts:91:29
 export function getJwtSignContext(variantAlgorithm?: Algorithm | 'none') {
   const algorithm = getJwtAlgorithm(variantAlgorithm) as SupportedJwtAlgorithm;
 
-  if (algorithm === 'none') {
-    return {
-      algorithm,
-      signingKey: null,
-      keyId: undefined,
-    };
-  }
+  if (algorithm === 'none') {}
 
   if (algorithm.startsWith('HS')) {

[Killed] BlockStatement
src/jwt/jwt.keys.ts:99:35
     };
   }
 
-  if (algorithm.startsWith('HS')) {
-    return {
-      algorithm,
-      signingKey:
-        process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret,
-      keyId: undefined,
-    };
-  }
+  if (algorithm.startsWith('HS')) {}
 
   return {
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must be a symmetric key when using HS256

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:99:7
     };
   }
 
-  if (algorithm.startsWith('HS')) {
+  if (false) {
     return {
       algorithm,
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must be a symmetric key when using HS256

[Killed] LogicalOperator
src/jwt/jwt.keys.ts:103:9
     return {
       algorithm,
       signingKey:
-        process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret,
+        (process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret) && APP_CONFIG.session.secret,
       keyId: undefined,
     };
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid signature

[Killed] BlockStatement
src/jwt/jwt.keys.ts:115:68
   };
 }
 
-export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === 'none') {
-    return null;
-  }
-
-  if (algorithm.startsWith('HS')) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
-  }
-
-  const publicKeys = loadPublicKeysFromConfig();
-  const activeKeyId = process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId;
-  return publicKeys[keyId ?? activeKeyId] ?? publicKeys[activeKeyId];
-}
+export function getJwtVerifyKey(algorithm: string, keyId?: string) {}
 
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:116:7
 }
 
 export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === 'none') {
+  if (true) {
     return null;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] EqualityOperator
src/jwt/jwt.keys.ts:116:7
 }
 
 export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === 'none') {
+  if (algorithm !== 'none') {
     return null;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] BlockStatement
src/jwt/jwt.keys.ts:120:35
     return null;
   }
 
-  if (algorithm.startsWith('HS')) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
-  }
+  if (algorithm.startsWith('HS')) {}
 
   const publicKeys = loadPublicKeysFromConfig();
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] MethodExpression
src/jwt/jwt.keys.ts:120:7
     return null;
   }
 
-  if (algorithm.startsWith('HS')) {
+  if (algorithm.endsWith('HS')) {
     return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] LogicalOperator
src/jwt/jwt.keys.ts:121:12
   }
 
   if (algorithm.startsWith('HS')) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
+    return (process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret) && APP_CONFIG.session.secret;
   }
 
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined
