[Survived] StringLiteral
src/sessions/sessions.routes.ts:14:13
 const csrfProtection = csrf({ cookie: true });
 
 // Login (no CSRF needed)
-router.post('/login', authLimiter, validateLogin, loginWithSession);
+router.post("", authLimiter, validateLogin, loginWithSession);
 
 // Protected route (DB-backed session)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:17:12
 router.post('/login', authLimiter, validateLogin, loginWithSession);
 
 // Protected route (DB-backed session)
-router.get('/protected', requireSession, getSessionProtected);
+router.get("", requireSession, getSessionProtected);
 
 // Logout (no CSRF needed)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:20:13
 router.get('/protected', requireSession, getSessionProtected);
 
 // Logout (no CSRF needed)
-router.post('/logout', logoutSession);
+router.post("", logoutSession);
 
 // These final two routes are intended for frontend/browser use.

[Survived] BlockStatement
src/sessions/sessions.routes.ts:27:57
 // so these endpoints are not used during backend API testing.
 
 // CSRF token endpoint (frontend would call this)
-router.get('/csrf-token', csrfProtection, (req, res) => {
-  res.json({ csrfToken: req.csrfToken() });
-});
+router.get('/csrf-token', csrfProtection, (req, res) => {});
 
 // CSRF-protected action (requires DB session + valid CSRF token)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:27:12
 // so these endpoints are not used during backend API testing.
 
 // CSRF token endpoint (frontend would call this)
-router.get('/csrf-token', csrfProtection, (req, res) => {
+router.get("", csrfProtection, (req, res) => {
   res.json({ csrfToken: req.csrfToken() });
 });

[Survived] BlockStatement
src/sessions/sessions.routes.ts:32:81
 });
 
 // CSRF-protected action (requires DB session + valid CSRF token)
-router.post('/protected-action', requireSession, csrfProtection, (_req, res) => {
-  res.json({ message: 'Protected action completed' });
-});
+router.post('/protected-action', requireSession, csrfProtection, (_req, res) => {});
 
 export default router;

[Survived] StringLiteral
src/sessions/sessions.routes.ts:32:13
 });
 
 // CSRF-protected action (requires DB session + valid CSRF token)
-router.post('/protected-action', requireSession, csrfProtection, (_req, res) => {
+router.post("", requireSession, csrfProtection, (_req, res) => {
   res.json({ message: 'Protected action completed' });
 });
