[Survived] BlockStatement
src/jwt/jwt.service.ts:41:29
     signOptions.keyid = keyId;
   }
 
-  if (algorithm === 'none') {
-    return jwt.sign({ userId }, null as any, {
-      ...signOptions,
-      algorithm: 'none',
-    });
-  }
+  if (algorithm === 'none') {}
 
   return jwt.sign({ userId }, signingKey as string, signOptions);

[Survived] ObjectLiteral
src/jwt/jwt.service.ts:42:21
   }
 
   if (algorithm === 'none') {
-    return jwt.sign({ userId }, null as any, {
+    return jwt.sign({}, null as any, {
       ...signOptions,
       algorithm: 'none',

[Survived] ObjectLiteral
src/jwt/jwt.service.ts:52:43
 }
 
 export function verifyJwt(token: string) {
-  const decodedHeader = jwt.decode(token, { complete: true });
+  const decodedHeader = jwt.decode(token, {});
   const header =
     typeof decodedHeader === 'object' && decodedHeader && 'header' in decodedHeader

[Survived] ConditionalExpression
src/jwt/jwt.service.ts:54:5
 export function verifyJwt(token: string) {
   const decodedHeader = jwt.decode(token, { complete: true });
   const header =
-    typeof decodedHeader === 'object' && decodedHeader && 'header' in decodedHeader
+    true && decodedHeader && 'header' in decodedHeader
       ? (decodedHeader.header as { alg?: string; kid?: string })
       : undefined;
