[Killed] ObjectLiteral
src/oauth/oauth.service.ts:27:18
     where: {
       code,
       used: false,
-      expiresAt: { gt: now },
+      expiresAt: {},
     },
     data: {
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects userId not found in DB
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] EqualityOperator
src/oauth/oauth.service.ts:78:7
   });
 
   if (!stored) return null;
-  if (stored.expiresAt < new Date()) return null;
+  if (stored.expiresAt <= new Date()) return null;
 
   return stored; // includes scope
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects non-UUID userId
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-TsjM0I\tests\setup.ts:57:23

  54 });
  55 
  56 // Legacy client used by older tests.
→ 57 await oauthClient.create(
