[Killed] ArithmeticOperator
src/sessions/session.service.ts:9:40
   return prisma.session.create({
     data: {
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24), // 24 hours
+      expiresAt: new Date(Date.now() + 1000 * 60 * 60 / 24), // 24 hours
     },
   });
killedBy: Session Middleware – Unit Tests Rejects invalid session
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.user.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\sessions\unit\session.middleware.test.ts:12:23

   9 beforeEach(async () => {
  10   await resetDatabase();
  11 
→ 12   await prisma.user.create(

[Killed] ArithmeticOperator
src/sessions/session.service.ts:9:27
   return prisma.session.create({
     data: {
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24), // 24 hours
+      expiresAt: new Date(Date.now() - 1000 * 60 * 60 * 24), // 24 hours
     },
   });
killedBy: Session Middleware – Unit Tests Rejects invalid session
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] ArithmeticOperator
src/sessions/session.service.ts:21:40
     data: {
       id: sessionId,
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24),
+      expiresAt: new Date(Date.now() + 1000 / 60 * 60 * 24),
     },
   });
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] ArithmeticOperator
src/sessions/session.service.ts:21:40
     data: {
       id: sessionId,
       userId,
-      expiresAt: new Date(Date.now() + 1000 * 60 * 60 * 24),
+      expiresAt: new Date(Date.now() + 1000 * 60 / 60 * 24),
     },
   });
killedBy: Session Middleware – Unit Tests Rejects missing cookie
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] BlockStatement
src/sessions/session.service.ts:26:56
   });
 }
 
-export async function deleteSession(sessionId: string) {
-  return prisma.session.delete({
-    where: { id: sessionId },
-  });
-}
+export async function deleteSession(sessionId: string) {}
 
 export async function findSession(sessionId: string) {
killedBy: Session Service – Unit Tests deleteSession removes a session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"id": "session-123"}}

Number of calls: 0

[Killed] BlockStatement
src/sessions/session.service.ts:39:54
 }
 
 // ⭐ Add this back — sessions login needs it
-export async function findUserByEmail(email: string) {
-  return prisma.user.findUnique({
-    where: { email },
-  });
-}
+export async function findUserByEmail(email: string) {}
killedBy: Session Middleware – Unit Tests Allows valid session
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.user.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\sessions\unit\session.middleware.test.ts:12:23

   9 beforeEach(async () => {
  10   await resetDatabase();
  11 
→ 12   await prisma.user.create(
