[Survived] BlockStatement
src/jwt/jwt.controller.ts:8:61
 import { generateJwt } from "./jwt.service";
 import { writeAuditEvent } from "../security/audit.service";
 
-export async function jwtLogin(req: Request, res: Response) {
-  const { email, password, mfaCode } = req.body;
-
-  const user = await findUserByEmail(email);
-  if (!user) {
-    await writeAuditEvent({ eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
-    return res.status(400).json({ error: "Invalid credentials" });
-  }
-
-  const valid = await isValidPassword(password, user.password);
-  if (!valid) {
-    await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-    return res.status(400).json({ error: "Invalid credentials" });
-  }
-
-  const mfaValid = await validateMfaForUser(user.id, mfaCode);
-  if (!mfaValid) {
-    await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
-    return res.status(401).json({ error: "MFA required or invalid code" });
-  }
-
-  const token = generateJwt(user.id);
-  await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
-  return res.status(200).json({ token });
-}
+export async function jwtLogin(req: Request, res: Response) {}
 
 export async function jwtProtected(req: Request, res: Response) {

[Survived] ObjectLiteral
src/jwt/jwt.controller.ts:13:136
 
   const user = await findUserByEmail(email);
   if (!user) {
-    await writeAuditEvent({ eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
+    await writeAuditEvent({ eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: {} });
     return res.status(400).json({ error: "Invalid credentials" });
   }

[Survived] BlockStatement
src/jwt/jwt.controller.ts:18:15
   }
 
   const valid = await isValidPassword(password, user.password);
-  if (!valid) {
-    await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-    return res.status(400).json({ error: "Invalid credentials" });
-  }
+  if (!valid) {}
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);

[Survived] BooleanLiteral
src/jwt/jwt.controller.ts:18:7
   }
 
   const valid = await isValidPassword(password, user.password);
-  if (!valid) {
+  if (valid) {
     await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
     return res.status(400).json({ error: "Invalid credentials" });

[Survived] StringLiteral
src/jwt/jwt.controller.ts:20:42
   const valid = await isValidPassword(password, user.password);
   if (!valid) {
     await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-    return res.status(400).json({ error: "Invalid credentials" });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] BooleanLiteral
src/jwt/jwt.controller.ts:24:7
   }
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);
-  if (!mfaValid) {
+  if (mfaValid) {
     await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
     return res.status(401).json({ error: "MFA required or invalid code" });

[Survived] BlockStatement
src/jwt/jwt.controller.ts:24:18
   }
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);
-  if (!mfaValid) {
-    await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
-    return res.status(401).json({ error: "MFA required or invalid code" });
-  }
+  if (!mfaValid) {}
 
   const token = generateJwt(user.id);

[Survived] StringLiteral
src/jwt/jwt.controller.ts:25:57
 
   const mfaValid = await validateMfaForUser(user.id, mfaCode);
   if (!mfaValid) {
-    await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
+    await writeAuditEvent({ userId: user.id, eventType: "", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
     return res.status(401).json({ error: "MFA required or invalid code" });
   }

[Survived] StringLiteral
src/jwt/jwt.controller.ts:30:126
   }
 
   const token = generateJwt(user.id);
-  await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
+  await writeAuditEvent({ userId: user.id, eventType: "jwt.login", outcome: "success", ipAddress: req.ip, userAgent: req.get("") });
   return res.status(200).json({ token });
 }

[Survived] BlockStatement
src/jwt/jwt.controller.ts:34:65
   return res.status(200).json({ token });
 }
 
-export async function jwtProtected(req: Request, res: Response) {
-  return res.json({
-    message: "JWT protected route accessed",
-    userId: (req as any).userId
-  });
-}
+export async function jwtProtected(req: Request, res: Response) {}
