[Survived] StringLiteral
src/oauth/oauth.controller.ts:11:49
 import { matchesStoredHashOrValue } from "../auth/password";
 import { writeAuditEvent } from "../security/audit.service";
 
-const SUPPORTED_PKCE_METHODS = new Set(["S256", "PLAIN"]);
+const SUPPORTED_PKCE_METHODS = new Set(["S256", ""]);
 
 function getUserAgent(req: Request) {

[Killed] EqualityOperator
src/oauth/oauth.controller.ts:14:7
 const SUPPORTED_PKCE_METHODS = new Set(["S256", "PLAIN"]);
 
 function getUserAgent(req: Request) {
-  if (typeof req.get === "function") {
+  if (typeof req.get !== "function") {
     return req.get("user-agent");
   }
killedBy: token controller returns access token for valid code
statusReason: TypeError: req.get is not a function

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:14:7
 const SUPPORTED_PKCE_METHODS = new Set(["S256", "PLAIN"]);
 
 function getUserAgent(req: Request) {
-  if (typeof req.get === "function") {
+  if (true) {
     return req.get("user-agent");
   }
killedBy: token controller returns access token for valid code
statusReason: TypeError: req.get is not a function

[Killed] OptionalChaining
src/oauth/oauth.controller.ts:18:18
     return req.get("user-agent");
   }
 
-  const header = req.headers?.["user-agent"];
+  const header = req.headers["user-agent"];
   return typeof header === "string" ? header : undefined;
 }
killedBy: authorize controller returns code for valid user
statusReason: TypeError: Cannot read properties of undefined (reading 'user-agent')

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:19:10
   }
 
   const header = req.headers?.["user-agent"];
-  return typeof header === "string" ? header : undefined;
+  return true ? header : undefined;
 }
 

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:19:10
   }
 
   const header = req.headers?.["user-agent"];
-  return typeof header === "string" ? header : undefined;
+  return false ? header : undefined;
 }
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:23:23
 }
 
 function getRequestedRedirectUri(req: Request) {
-  const redirectUri = req.body.redirectUri ?? req.body.redirect_uri;
+  const redirectUri = req.body.redirectUri && req.body.redirect_uri;
   return typeof redirectUri === "string" ? redirectUri : undefined;
 }

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:24:10
 
 function getRequestedRedirectUri(req: Request) {
   const redirectUri = req.body.redirectUri ?? req.body.redirect_uri;
-  return typeof redirectUri === "string" ? redirectUri : undefined;
+  return true ? redirectUri : undefined;
 }
 

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:24:10
 
 function getRequestedRedirectUri(req: Request) {
   const redirectUri = req.body.redirectUri ?? req.body.redirect_uri;
-  return typeof redirectUri === "string" ? redirectUri : undefined;
+  return typeof redirectUri !== "string" ? redirectUri : undefined;
 }
 

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:29:12
 
 function validateRedirectUri(redirectUri: string | undefined) {
   if (!redirectUri) {
-    return true;
+    return false;
   }
 

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:52:20
     redirectUri,
     redirect_uri,
   } = req.body;
-  const clientId = req.body.clientId ?? req.body.client_id;
+  const clientId = req.body.clientId && req.body.client_id;
 
   if (!userId) {
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] StringLiteral
src/oauth/oauth.controller.ts:55:42
   const clientId = req.body.clientId ?? req.body.client_id;
 
   if (!userId) {
-    return res.status(400).json({ error: "Missing userId" });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:63:42
   });
 
   if (!user) {
-    return res.status(400).json({ error: "User not found" });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:71:42
   });
 
   if (!client) {
-    return res.status(400).json({ error: "Invalid clientId" });
+    return res.status(400).json({ error: "" });
   }
 

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:74:7
     return res.status(400).json({ error: "Invalid clientId" });
   }
 
-  if (APP_CONFIG.oauth.requirePkce && !code_challenge) {
+  if (true) {
     return res.status(400).json({
       error: "invalid_request",
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:74:7
     return res.status(400).json({ error: "Invalid clientId" });
   }
 
-  if (APP_CONFIG.oauth.requirePkce && !code_challenge) {
+  if (APP_CONFIG.oauth.requirePkce || !code_challenge) {
     return res.status(400).json({
       error: "invalid_request",
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:81:7
     });
   }
 
-  if (code_challenge_method && !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())) {
+  if (code_challenge_method || !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())) {
     return res.status(400).json({
       error: "invalid_request",
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:81:7
     });
   }
 
-  if (code_challenge_method && !SUPPORTED_PKCE_METHODS.has(String(code_challenge_method).toUpperCase())) {
+  if (true) {
     return res.status(400).json({
       error: "invalid_request",
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:92:38
     // ------------------------------------------------------
   // ⭐ SCOPE VALIDATION (NEW)
   // ------------------------------------------------------
-  const requestedScopes: string[] = (scope ?? "read").split(" ");
+  const requestedScopes: string[] = (scope && "read").split(" ");
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];

[Killed] StringLiteral
src/oauth/oauth.controller.ts:92:61
     // ------------------------------------------------------
   // ⭐ SCOPE VALIDATION (NEW)
   // ------------------------------------------------------
-  const requestedScopes: string[] = (scope ?? "read").split(" ");
+  const requestedScopes: string[] = (scope ?? "read").split("");
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BooleanLiteral
src/oauth/oauth.controller.ts:96:45
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];
 
-  const invalid = requestedScopes.some(s => !allowedScopes.includes(s));
+  const invalid = requestedScopes.some(s => allowedScopes.includes(s));
 
   if (invalid) {
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] MethodExpression
src/oauth/oauth.controller.ts:96:19
 
   const allowedScopes = variantOverrides.oauth?.defaultScopes ?? clientScopes[clientId] ?? [];
 
-  const invalid = requestedScopes.some(s => !allowedScopes.includes(s));
+  const invalid = requestedScopes.every(s => !allowedScopes.includes(s));
 
   if (invalid) {

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:98:7
 
   const invalid = requestedScopes.some(s => !allowedScopes.includes(s));
 
-  if (invalid) {
+  if (true) {
     return res.status(400).json({
       error: "invalid_scope",
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:98:7
 
   const invalid = requestedScopes.some(s => !allowedScopes.includes(s));
 
-  if (invalid) {
+  if (false) {
     return res.status(400).json({
       error: "invalid_scope",

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:109:40
 
 
   const requestedRedirectUri = getRequestedRedirectUri(req);
-  const hasConflictingRedirectValues = redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
+  const hasConflictingRedirectValues = true;
 
   if ((requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) || hasConflictingRedirectValues) {
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:109:40
 
 
   const requestedRedirectUri = getRequestedRedirectUri(req);
-  const hasConflictingRedirectValues = redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
+  const hasConflictingRedirectValues = redirectUri === undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
 
   if ((requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) || hasConflictingRedirectValues) {

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:111:7
   const requestedRedirectUri = getRequestedRedirectUri(req);
   const hasConflictingRedirectValues = redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
 
-  if ((requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) || hasConflictingRedirectValues) {
+  if (true) {
     return res.status(400).json({ error: "Invalid redirect URI" });
   }
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:111:8
   const requestedRedirectUri = getRequestedRedirectUri(req);
   const hasConflictingRedirectValues = redirectUri !== undefined && redirect_uri !== undefined && redirectUri !== redirect_uri;
 
-  if ((requestedRedirectUri && !validateRedirectUri(requestedRedirectUri)) || hasConflictingRedirectValues) {
+  if ((false) || hasConflictingRedirectValues) {
     return res.status(400).json({ error: "Invalid redirect URI" });
   }

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:122:14
       code,
       userId,
       clientId,
-      state: state ?? null,
+      state: state && null,
       scope: scope ?? "read",
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:123:14
       userId,
       clientId,
       state: state ?? null,
-      scope: scope ?? "read",
+      scope: scope && "read",
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:124:40
       clientId,
       state: state ?? null,
       scope: scope ?? "read",
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds / 1000),
       codeChallenge: code_challenge ?? null,
       codeChallengeMethod: code_challenge_method ?? null,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:124:27
       clientId,
       state: state ?? null,
       scope: scope ?? "read",
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() - APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,
       codeChallengeMethod: code_challenge_method ?? null,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:125:22
       state: state ?? null,
       scope: scope ?? "read",
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
-      codeChallenge: code_challenge ?? null,
+      codeChallenge: code_challenge && null,
       codeChallengeMethod: code_challenge_method ?? null,
       used: false,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:126:28
       scope: scope ?? "read",
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,
-      codeChallengeMethod: code_challenge_method ?? null,
+      codeChallengeMethod: code_challenge_method && null,
       used: false,
     },

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:127:13
       expiresAt: new Date(Date.now() + APP_CONFIG.oauth.authorizationCodeTtlSeconds * 1000),
       codeChallenge: code_challenge ?? null,
       codeChallengeMethod: code_challenge_method ?? null,
-      used: false,
+      used: true,
     },
   });

[Survived] StringLiteral
src/oauth/oauth.controller.ts:133:16
 
   await writeAuditEvent({
     userId,
-    eventType: "oauth.authorize",
+    eventType: "",
     outcome: "success",
     ipAddress: req.ip,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:137:34
     outcome: "success",
     ipAddress: req.ip,
     userAgent: getUserAgent(req),
-    metadata: { clientId, scope: scope ?? "read" },
+    metadata: { clientId, scope: scope && "read" },
   });
 

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:137:15
     outcome: "success",
     ipAddress: req.ip,
     userAgent: getUserAgent(req),
-    metadata: { clientId, scope: scope ?? "read" },
+    metadata: {},
   });
 

[Killed] ObjectLiteral
src/oauth/oauth.controller.ts:140:31
     metadata: { clientId, scope: scope ?? "read" },
   });
 
-  return res.status(200).json({
-    code,
-    state: state ?? null,
-  });
+  return res.status(200).json({});
 }
 
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "code": Any<String>,
-   "state": null,

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:142:12
 
   return res.status(200).json({
     code,
-    state: state ?? null,
+    state: state && null,
   });
 }
killedBy: authorize controller returns code for valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "code": Any<String>,
-   "state": null,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:152:24
 export async function token(req: Request, res: Response) {
   const variantOverrides = getVariantOverrides();
   const { code, state } = req.body;
-  const codeVerifier = req.body.code_verifier ?? req.body.codeVerifier;
+  const codeVerifier = req.body.code_verifier && req.body.codeVerifier;
   const requestClientId = req.body.clientId ?? req.body.client_id;
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:153:27
   const variantOverrides = getVariantOverrides();
   const { code, state } = req.body;
   const codeVerifier = req.body.code_verifier ?? req.body.codeVerifier;
-  const requestClientId = req.body.clientId ?? req.body.client_id;
+  const requestClientId = req.body.clientId && req.body.client_id;
 
   const auth = req.headers.authorization;

[Survived] BlockStatement
src/oauth/oauth.controller.ts:158:35
   const auth = req.headers.authorization;
   let authenticatedClientId: string | undefined;
 
-  if (auth?.startsWith("Basic ")) {
-    const base64 = auth.replace("Basic ", "");
-    const [clientId, clientSecret] = Buffer.from(base64, "base64")
-      .toString("utf8")
-      .split(":");
-
-    const client = await prisma.oAuthClient.findUnique({
-      where: { id: clientId },
-    });
-
-    if (!client || !(await matchesStoredHashOrValue(clientSecret, client.secret))) {
-      return res.status(401).json({
-        error: "invalid_client",
-        error_description: "Invalid client credentials",
-      });
-    }
-
-    authenticatedClientId = client.id;
-  }
+  if (auth?.startsWith("Basic ")) {}
 
   if (!code) {

[Survived] MethodExpression
src/oauth/oauth.controller.ts:158:7
   const auth = req.headers.authorization;
   let authenticatedClientId: string | undefined;
 
-  if (auth?.startsWith("Basic ")) {
+  if (auth?.endsWith("Basic ")) {
     const base64 = auth.replace("Basic ", "");
     const [clientId, clientSecret] = Buffer.from(base64, "base64")

[Killed] StringLiteral
src/oauth/oauth.controller.ts:159:33
   let authenticatedClientId: string | undefined;
 
   if (auth?.startsWith("Basic ")) {
-    const base64 = auth.replace("Basic ", "");
+    const base64 = auth.replace("", "");
     const [clientId, clientSecret] = Buffer.from(base64, "base64")
       .toString("utf8")
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] BooleanLiteral
src/oauth/oauth.controller.ts:168:20
       where: { id: clientId },
     });
 
-    if (!client || !(await matchesStoredHashOrValue(clientSecret, client.secret))) {
+    if (!client || await matchesStoredHashOrValue(clientSecret, client.secret)) {
       return res.status(401).json({
         error: "invalid_client",
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Survived] StringLiteral
src/oauth/oauth.controller.ts:170:16
 
     if (!client || !(await matchesStoredHashOrValue(clientSecret, client.secret))) {
       return res.status(401).json({
-        error: "invalid_client",
+        error: "",
         error_description: "Invalid client credentials",
       });

[Killed] BooleanLiteral
src/oauth/oauth.controller.ts:178:7
     authenticatedClientId = client.id;
   }
 
-  if (!code) {
+  if (code) {
     return res.status(400).json({ error: "Missing code" });
   }
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] BlockStatement
src/oauth/oauth.controller.ts:178:14
     authenticatedClientId = client.id;
   }
 
-  if (!code) {
-    return res.status(400).json({ error: "Missing code" });
-  }
+  if (!code) {}
 
   if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:179:33
   }
 
   if (!code) {
-    return res.status(400).json({ error: "Missing code" });
+    return res.status(400).json({});
   }
 

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:182:7
     return res.status(400).json({ error: "Missing code" });
   }
 
-  if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
+  if (requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
     return res.status(400).json({
       error: "invalid_client",

[Survived] BlockStatement
src/oauth/oauth.controller.ts:182:78
     return res.status(400).json({ error: "Missing code" });
   }
 
-  if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
-    return res.status(400).json({
-      error: "invalid_client",
-      error_description: "Missing client_id",
-    });
-  }
+  if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {}
 
   const stored = await prisma.oAuthAuthorizationCode.findUnique({

[Survived] StringLiteral
src/oauth/oauth.controller.ts:185:26
   if (!requestClientId && !authenticatedClientId && APP_CONFIG.isProduction) {
     return res.status(400).json({
       error: "invalid_client",
-      error_description: "Missing client_id",
+      error_description: "",
     });
   }

[Survived] StringLiteral
src/oauth/oauth.controller.ts:194:42
   });
 
   if (!stored) {
-    return res.status(400).json({ error: "Invalid authorization code" });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:197:7
     return res.status(400).json({ error: "Invalid authorization code" });
   }
 
-  if (stored.used) {
+  if (false) {
     return res.status(400).json({ error: "Authorization code already used" });
   }

[Survived] BlockStatement
src/oauth/oauth.controller.ts:197:20
     return res.status(400).json({ error: "Invalid authorization code" });
   }
 
-  if (stored.used) {
-    return res.status(400).json({ error: "Authorization code already used" });
-  }
+  if (stored.used) {}
 
   const validateState = variantOverrides.oauth?.validateState ?? true;

[Survived] StringLiteral
src/oauth/oauth.controller.ts:198:42
   }
 
   if (stored.used) {
-    return res.status(400).json({ error: "Authorization code already used" });
+    return res.status(400).json({ error: "" });
   }
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:201:25
     return res.status(400).json({ error: "Authorization code already used" });
   }
 
-  const validateState = variantOverrides.oauth?.validateState ?? true;
+  const validateState = variantOverrides.oauth?.validateState && true;
   if (validateState && stored.state && stored.state !== state) {
     return res.status(400).json({ error: "Invalid state" });

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:201:66
     return res.status(400).json({ error: "Authorization code already used" });
   }
 
-  const validateState = variantOverrides.oauth?.validateState ?? true;
+  const validateState = variantOverrides.oauth?.validateState ?? false;
   if (validateState && stored.state && stored.state !== state) {
     return res.status(400).json({ error: "Invalid state" });

[Survived] BlockStatement
src/oauth/oauth.controller.ts:202:64
   }
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
-  if (validateState && stored.state && stored.state !== state) {
-    return res.status(400).json({ error: "Invalid state" });
-  }
+  if (validateState && stored.state && stored.state !== state) {}
 
   if (authenticatedClientId && authenticatedClientId !== stored.clientId) {

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:202:40
   }
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
-  if (validateState && stored.state && stored.state !== state) {
+  if (validateState && stored.state && stored.state === state) {
     return res.status(400).json({ error: "Invalid state" });
   }

[Survived] StringLiteral
src/oauth/oauth.controller.ts:203:42
 
   const validateState = variantOverrides.oauth?.validateState ?? true;
   if (validateState && stored.state && stored.state !== state) {
-    return res.status(400).json({ error: "Invalid state" });
+    return res.status(400).json({ error: "" });
   }
 

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:206:7
     return res.status(400).json({ error: "Invalid state" });
   }
 
-  if (authenticatedClientId && authenticatedClientId !== stored.clientId) {
+  if (authenticatedClientId || authenticatedClientId !== stored.clientId) {
     return res.status(401).json({
       error: "invalid_client",
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:206:32
     return res.status(400).json({ error: "Invalid state" });
   }
 
-  if (authenticatedClientId && authenticatedClientId !== stored.clientId) {
+  if (authenticatedClientId && true) {
     return res.status(401).json({
       error: "invalid_client",
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Survived] StringLiteral
src/oauth/oauth.controller.ts:209:26
   if (authenticatedClientId && authenticatedClientId !== stored.clientId) {
     return res.status(401).json({
       error: "invalid_client",
-      error_description: "Client does not match authorization code",
+      error_description: "",
     });
   }

[Killed] LogicalOperator
src/oauth/oauth.controller.ts:213:7
     });
   }
 
-  if (requestClientId && requestClientId !== stored.clientId) {
+  if (requestClientId || requestClientId !== stored.clientId) {
     return res.status(401).json({
       error: "invalid_client",
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:213:7
     });
   }
 
-  if (requestClientId && requestClientId !== stored.clientId) {
+  if (false) {
     return res.status(401).json({
       error: "invalid_client",

[Killed] ConditionalExpression
src/oauth/oauth.controller.ts:221:7
   }
 
   // PKCE verification (only if a challenge was stored)
-  if (stored.codeChallenge) {
+  if (true) {
     if (!codeVerifier) {
       return res.status(400).json({
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] BlockStatement
src/oauth/oauth.controller.ts:221:29
   }
 
   // PKCE verification (only if a challenge was stored)
-  if (stored.codeChallenge) {
-    if (!codeVerifier) {
-      return res.status(400).json({
-        error: "invalid_request",
-        error_description: "Missing code_verifier",
-      });
-    }
-
-    const method = (stored.codeChallengeMethod ?? "plain").toUpperCase();
-    const computedChallenge = method === "S256"
-      ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")
-      : codeVerifier;
-
-    if (computedChallenge !== stored.codeChallenge) {
-      return res.status(400).json({
-        error: "invalid_grant",
-        error_description: "PKCE verification failed",
-      });
-    }
-  }
+  if (stored.codeChallenge) {}
 
   const tokenResult = await exchangeCodeForToken(code);

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:222:9
 
   // PKCE verification (only if a challenge was stored)
   if (stored.codeChallenge) {
-    if (!codeVerifier) {
+    if (codeVerifier) {
       return res.status(400).json({
         error: "invalid_request",

[Survived] BlockStatement
src/oauth/oauth.controller.ts:222:24
 
   // PKCE verification (only if a challenge was stored)
   if (stored.codeChallenge) {
-    if (!codeVerifier) {
-      return res.status(400).json({
-        error: "invalid_request",
-        error_description: "Missing code_verifier",
-      });
-    }
+    if (!codeVerifier) {}
 
     const method = (stored.codeChallengeMethod ?? "plain").toUpperCase();

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:223:35
   // PKCE verification (only if a challenge was stored)
   if (stored.codeChallenge) {
     if (!codeVerifier) {
-      return res.status(400).json({
-        error: "invalid_request",
-        error_description: "Missing code_verifier",
-      });
+      return res.status(400).json({});
     }
 

[Survived] MethodExpression
src/oauth/oauth.controller.ts:229:20
       });
     }
 
-    const method = (stored.codeChallengeMethod ?? "plain").toUpperCase();
+    const method = (stored.codeChallengeMethod ?? "plain").toLowerCase();
     const computedChallenge = method === "S256"
       ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:230:31
     }
 
     const method = (stored.codeChallengeMethod ?? "plain").toUpperCase();
-    const computedChallenge = method === "S256"
+    const computedChallenge = false
       ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")
       : codeVerifier;

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:230:31
     }
 
     const method = (stored.codeChallengeMethod ?? "plain").toUpperCase();
-    const computedChallenge = method === "S256"
+    const computedChallenge = true
       ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")
       : codeVerifier;

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:234:9
       ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")
       : codeVerifier;
 
-    if (computedChallenge !== stored.codeChallenge) {
+    if (false) {
       return res.status(400).json({
         error: "invalid_grant",

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:234:9
       ? crypto.createHash("sha256").update(codeVerifier).digest("base64url")
       : codeVerifier;
 
-    if (computedChallenge !== stored.codeChallenge) {
+    if (true) {
       return res.status(400).json({
         error: "invalid_grant",

[Survived] StringLiteral
src/oauth/oauth.controller.ts:237:28
     if (computedChallenge !== stored.codeChallenge) {
       return res.status(400).json({
         error: "invalid_grant",
-        error_description: "PKCE verification failed",
+        error_description: "",
       });
     }
