[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:254:15
     outcome: "success",
     ipAddress: req.ip,
     userAgent: getUserAgent(req),
-    metadata: { clientId: stored.clientId },
+    metadata: {},
   });
 

[Killed] ObjectLiteral
src/oauth/oauth.controller.ts:257:31
     metadata: { clientId: stored.clientId },
   });
 
-  return res.status(200).json({
-    access_token: tokenResult.accessToken,
-    refresh_token: tokenResult.refreshToken,
-    token_type: "Bearer",
-    expires_in: 3600,
-  });
+  return res.status(200).json({});
 }
 
killedBy: token controller returns access token for valid code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "access_token": "jwt-token",
-   "expires_in": 3600,

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:269:24
 // REFRESH TOKEN
 // ------------------------------------------------------
 export async function refresh(req: Request, res: Response) {
-  const refreshToken = req.body.refresh_token ?? req.body.refreshToken;
+  const refreshToken = req.body.refresh_token && req.body.refreshToken;
   const clientId = req.body.clientId ?? req.body.client_id;
 

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:270:20
 // ------------------------------------------------------
 export async function refresh(req: Request, res: Response) {
   const refreshToken = req.body.refresh_token ?? req.body.refreshToken;
-  const clientId = req.body.clientId ?? req.body.client_id;
+  const clientId = req.body.clientId && req.body.client_id;
 
   if (!refreshToken) {

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:272:7
   const refreshToken = req.body.refresh_token ?? req.body.refreshToken;
   const clientId = req.body.clientId ?? req.body.client_id;
 
-  if (!refreshToken) {
+  if (false) {
     return res.status(400).json({
       error: "invalid_request",

[Survived] BlockStatement
src/oauth/oauth.controller.ts:272:22
   const refreshToken = req.body.refresh_token ?? req.body.refreshToken;
   const clientId = req.body.clientId ?? req.body.client_id;
 
-  if (!refreshToken) {
-    return res.status(400).json({
-      error: "invalid_request",
-      error_description: "Missing refresh_token",
-    });
-  }
+  if (!refreshToken) {}
 
   const newAccessToken = crypto.randomUUID();

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:283:12
   const newRefreshToken = crypto.randomUUID();
 
   const rotated = await prisma.oAuthAccessToken.updateMany({
-    where: {
-      refreshToken: hashOpaqueToken(refreshToken),
-      clientId,
-    },
+    where: {},
     data: {
       accessToken: hashOpaqueToken(newAccessToken),

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:290:27
     data: {
       accessToken: hashOpaqueToken(newAccessToken),
       refreshToken: hashOpaqueToken(newRefreshToken),
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() - APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
     },
   });

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:290:40
     data: {
       accessToken: hashOpaqueToken(newAccessToken),
       refreshToken: hashOpaqueToken(newRefreshToken),
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds / 1000),
     },
   });

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:294:7
     },
   });
 
-  if (rotated.count !== 1) {
+  if (false) {
     return res.status(400).json({
       error: "invalid_grant",

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:294:7
     },
   });
 
-  if (rotated.count !== 1) {
+  if (true) {
     return res.status(400).json({
       error: "invalid_grant",

[Survived] StringLiteral
src/oauth/oauth.controller.ts:297:26
   if (rotated.count !== 1) {
     return res.status(400).json({
       error: "invalid_grant",
-      error_description: "Invalid refresh token",
+      error_description: "",
     });
   }

[Survived] ObjectLiteral
src/oauth/oauth.controller.ts:301:19
     });
   }
 
-  return res.json({
-    access_token: newAccessToken,
-    refresh_token: newRefreshToken,
-    token_type: "Bearer",
-    expires_in: 3600,
-  });
+  return res.json({});
 }
 

[Survived] StringLiteral
src/oauth/oauth.controller.ts:304:17
   return res.json({
     access_token: newAccessToken,
     refresh_token: newRefreshToken,
-    token_type: "Bearer",
+    token_type: "",
     expires_in: 3600,
   });

[Survived] BlockStatement
src/oauth/oauth.controller.ts:315:15
 export async function revoke(req: Request, res: Response) {
   const { token } = req.body;
 
-  if (!token) {
-    return res.status(400).json({
-      error: "invalid_request",
-      error_description: "Missing token",
-    });
-  }
+  if (!token) {}
 
   const access = await prisma.oAuthAccessToken.findUnique({

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:326:7
     where: { accessToken: hashOpaqueToken(token) },
   });
 
-  if (access) {
+  if (true) {
     await prisma.oAuthAccessToken.delete({ where: { accessToken: hashOpaqueToken(token) } });
     return res.status(200).send();

[Survived] BlockStatement
src/oauth/oauth.controller.ts:326:15
     where: { accessToken: hashOpaqueToken(token) },
   });
 
-  if (access) {
-    await prisma.oAuthAccessToken.delete({ where: { accessToken: hashOpaqueToken(token) } });
-    return res.status(200).send();
-  }
+  if (access) {}
 
   const refresh = await prisma.oAuthAccessToken.findUnique({

[Survived] BlockStatement
src/oauth/oauth.controller.ts:335:16
     where: { refreshToken: hashOpaqueToken(token) },
   });
 
-  if (refresh) {
-    await prisma.oAuthAccessToken.delete({ where: { refreshToken: hashOpaqueToken(token) } });
-    return res.status(200).send();
-  }
+  if (refresh) {}
 
   return res.status(200).send();

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:335:7
     where: { refreshToken: hashOpaqueToken(token) },
   });
 
-  if (refresh) {
+  if (false) {
     await prisma.oAuthAccessToken.delete({ where: { refreshToken: hashOpaqueToken(token) } });
     return res.status(200).send();

[Survived] BlockStatement
src/oauth/oauth.controller.ts:349:15
 export async function introspect(req: Request, res: Response) {
   const { token } = req.body;
 
-  if (!token) {
-    return res.status(400).json({
-      active: false,
-      error: "invalid_request",
-      error_description: "Missing token",
-    });
-  }
+  if (!token) {}
 
   const access = await prisma.oAuthAccessToken.findUnique({

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:351:15
 
   if (!token) {
     return res.status(400).json({
-      active: false,
+      active: true,
       error: "invalid_request",
       error_description: "Missing token",

[Survived] BlockStatement
src/oauth/oauth.controller.ts:361:15
     where: { accessToken: hashOpaqueToken(token) },
   });
 
-  if (access) {
-    const now = new Date();
-    const active = access.expiresAt > now;
-
-    return res.json({
-      active,
-      scope: access.scope ?? null,
-      client_id: access.clientId,
-      user_id: access.userId,
-      exp: Math.floor(access.expiresAt.getTime() / 1000),
-      token_type: "access_token",
-    });
-  }
+  if (access) {}
 
   const refresh = await prisma.oAuthAccessToken.findUnique({

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:363:20
 
   if (access) {
     const now = new Date();
-    const active = access.expiresAt > now;
+    const active = access.expiresAt <= now;
 
     return res.json({

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:363:20
 
   if (access) {
     const now = new Date();
-    const active = access.expiresAt > now;
+    const active = true;
 
     return res.json({

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:367:14
 
     return res.json({
       active,
-      scope: access.scope ?? null,
+      scope: access.scope && null,
       client_id: access.clientId,
       user_id: access.userId,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:370:23
       scope: access.scope ?? null,
       client_id: access.clientId,
       user_id: access.userId,
-      exp: Math.floor(access.expiresAt.getTime() / 1000),
+      exp: Math.floor(access.expiresAt.getTime() * 1000),
       token_type: "access_token",
     });

[Survived] BlockStatement
src/oauth/oauth.controller.ts:379:16
     where: { refreshToken: token },
   });
 
-  if (refresh) {
-    const now = new Date();
-    const active = refresh.expiresAt > now;
-
-    return res.json({
-      active,
-      scope: refresh.scope ?? null,
-      client_id: refresh.clientId,
-      user_id: refresh.userId,
-      exp: Math.floor(refresh.expiresAt.getTime() / 1000),
-      token_type: "refresh_token",
-    });
-  }
+  if (refresh) {}
 
   return res.json({ active: false });

[Survived] ConditionalExpression
src/oauth/oauth.controller.ts:381:20
 
   if (refresh) {
     const now = new Date();
-    const active = refresh.expiresAt > now;
+    const active = false;
 
     return res.json({

[Survived] EqualityOperator
src/oauth/oauth.controller.ts:381:20
 
   if (refresh) {
     const now = new Date();
-    const active = refresh.expiresAt > now;
+    const active = refresh.expiresAt <= now;
 
     return res.json({

[Survived] LogicalOperator
src/oauth/oauth.controller.ts:385:14
 
     return res.json({
       active,
-      scope: refresh.scope ?? null,
+      scope: refresh.scope && null,
       client_id: refresh.clientId,
       user_id: refresh.userId,

[Survived] ArithmeticOperator
src/oauth/oauth.controller.ts:388:23
       scope: refresh.scope ?? null,
       client_id: refresh.clientId,
       user_id: refresh.userId,
-      exp: Math.floor(refresh.expiresAt.getTime() / 1000),
+      exp: Math.floor(refresh.expiresAt.getTime() * 1000),
       token_type: "refresh_token",
     });

[Survived] BooleanLiteral
src/oauth/oauth.controller.ts:393:29
     });
   }
 
-  return res.json({ active: false });
+  return res.json({ active: true });
 }
 
