[Survived] BlockStatement
src/oauth/oauth.middleware.ts:10:3
   req: Request,
   res: Response,
   next: NextFunction
-) {
-  const header = req.headers.authorization;
-
-  if (!header || !header.startsWith("Bearer ")) {
-    return res.status(401).json({ error: "Missing Authorization header" });
-  }
-
-  const token = header.replace("Bearer ", "");
-  const valid = await validateAccessToken(token);
-
-  if (!valid) {
-    return res.status(401).json({ error: "Invalid or expired token" });
-  }
-
-  (req as any).userId = valid.userId;
-  (req as any).clientId = valid.clientId;
-  (req as any).scope = valid.scope;
-
-  next();
-}
+) {}
 
 // 🔐 Validate /authorize input

[Survived] MethodExpression
src/oauth/oauth.middleware.ts:13:19
 ) {
   const header = req.headers.authorization;
 
-  if (!header || !header.startsWith("Bearer ")) {
+  if (!header || !header.endsWith("Bearer ")) {
     return res.status(401).json({ error: "Missing Authorization header" });
   }

[Survived] BooleanLiteral
src/oauth/oauth.middleware.ts:13:18
 ) {
   const header = req.headers.authorization;
 
-  if (!header || !header.startsWith("Bearer ")) {
+  if (!header || header.startsWith("Bearer ")) {
     return res.status(401).json({ error: "Missing Authorization header" });
   }

[Survived] StringLiteral
src/oauth/oauth.middleware.ts:17:32
     return res.status(401).json({ error: "Missing Authorization header" });
   }
 
-  const token = header.replace("Bearer ", "");
+  const token = header.replace("", "");
   const valid = await validateAccessToken(token);
 

[Survived] StringLiteral
src/oauth/oauth.middleware.ts:17:43
     return res.status(401).json({ error: "Missing Authorization header" });
   }
 
-  const token = header.replace("Bearer ", "");
+  const token = header.replace("Bearer ", "Stryker was here!");
   const valid = await validateAccessToken(token);
 

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:36:33
   const { userId } = req.body;
 
   if (!userId) {
-    return res.status(400).json({ error: "userId is required" });
+    return res.status(400).json({});
   }
 

[Killed] EqualityOperator
src/oauth/oauth.middleware.ts:39:7
     return res.status(400).json({ error: "userId is required" });
   }
 
-  if (typeof userId !== "string") {
+  if (typeof userId === "string") {
     return res.status(400).json({ error: "userId must be a string" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:39:7
     return res.status(400).json({ error: "userId is required" });
   }
 
-  if (typeof userId !== "string") {
+  if (true) {
     return res.status(400).json({ error: "userId must be a string" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:40:33
   }
 
   if (typeof userId !== "string") {
-    return res.status(400).json({ error: "userId must be a string" });
+    return res.status(400).json({});
   }
 

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:43:7
     return res.status(400).json({ error: "userId must be a string" });
   }
 
-  if (/^\d+$/.test(userId)) {
+  if (true) {
     return res.status(400).json({ error: "userId cannot be numeric" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/oauth/oauth.middleware.ts:43:7
     return res.status(400).json({ error: "userId must be a string" });
   }
 
-  if (/^\d+$/.test(userId)) {
+  if (false) {
     return res.status(400).json({ error: "userId cannot be numeric" });
   }

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:44:33
   }
 
   if (/^\d+$/.test(userId)) {
-    return res.status(400).json({ error: "userId cannot be numeric" });
+    return res.status(400).json({});
   }
 

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:47:7
     return res.status(400).json({ error: "userId cannot be numeric" });
   }
 
-  if (/[<>]/.test(userId)) {
+  if (true) {
     return res.status(400).json({ error: "userId contains invalid characters" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
src/oauth/oauth.middleware.ts:47:28
     return res.status(400).json({ error: "userId cannot be numeric" });
   }
 
-  if (/[<>]/.test(userId)) {
-    return res.status(400).json({ error: "userId contains invalid characters" });
-  }
+  if (/[<>]/.test(userId)) {}
 
   const uuidRegex =

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:48:33
   }
 
   if (/[<>]/.test(userId)) {
-    return res.status(400).json({ error: "userId contains invalid characters" });
+    return res.status(400).json({});
   }
 

[Killed] Regex
src/oauth/oauth.middleware.ts:52:5
   }
 
   const uuidRegex =
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
+    /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[^0-9a-f]{12}$/i;
 
   if (!uuidRegex.test(userId)) {
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] Regex
src/oauth/oauth.middleware.ts:52:5
   }
 
   const uuidRegex =
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
+    /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/i;
 
   if (!uuidRegex.test(userId)) {

[Killed] BooleanLiteral
src/oauth/oauth.middleware.ts:54:7
   const uuidRegex =
     /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
 
-  if (!uuidRegex.test(userId)) {
+  if (uuidRegex.test(userId)) {
     return res.status(400).json({ error: "userId must be a valid UUID" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:54:7
   const uuidRegex =
     /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
 
-  if (!uuidRegex.test(userId)) {
+  if (true) {
     return res.status(400).json({ error: "userId must be a valid UUID" });
   }
killedBy: validateAuthorize accepts valid user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/oauth/oauth.middleware.ts:55:33
     /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
 
   if (!uuidRegex.test(userId)) {
-    return res.status(400).json({ error: "userId must be a valid UUID" });
+    return res.status(400).json({});
   }
 

[Survived] StringLiteral
src/oauth/oauth.middleware.ts:55:42
     /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i;
 
   if (!uuidRegex.test(userId)) {
-    return res.status(400).json({ error: "userId must be a valid UUID" });
+    return res.status(400).json({ error: "" });
   }
 

[Killed] BlockStatement
src/oauth/oauth.middleware.ts:62:14
     where: { id: userId }
   });
 
-  if (!user) {
-    return res.status(400).json({ error: "User does not exist" });
-  }
+  if (!user) {}
 
   next();
killedBy: validateAuthorize rejects non-existent user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Survived] StringLiteral
src/oauth/oauth.middleware.ts:63:42
   });
 
   if (!user) {
-    return res.status(400).json({ error: "User does not exist" });
+    return res.status(400).json({ error: "" });
   }
 

[Killed] BlockStatement
src/oauth/oauth.middleware.ts:70:80
 }
 
 // 🔐 Validate /token input
-export function validateToken(req: Request, res: Response, next: NextFunction) {
-  const { code } = req.body;
-
-  if (!code || typeof code !== "string") {
-    return res.status(400).json({
-      error: "authorization code is required and must be a string"
-    });
-  }
-
-  next();
-}
+export function validateToken(req: Request, res: Response, next: NextFunction) {}
 
killedBy: validateToken middleware returns 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
src/oauth/oauth.middleware.ts:73:7
 export function validateToken(req: Request, res: Response, next: NextFunction) {
   const { code } = req.body;
 
-  if (!code || typeof code !== "string") {
+  if (false) {
     return res.status(400).json({
       error: "authorization code is required and must be a string"
killedBy: validateToken middleware returns 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] EqualityOperator
src/oauth/oauth.middleware.ts:73:16
 export function validateToken(req: Request, res: Response, next: NextFunction) {
   const { code } = req.body;
 
-  if (!code || typeof code !== "string") {
+  if (!code || typeof code === "string") {
     return res.status(400).json({
       error: "authorization code is required and must be a string"
killedBy: validateToken middleware calls next() if code is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
