[Killed] BlockStatement
src/jwt/jwt.middleware.ts:13:7
 
   const token = header.split(" ")[1];
 
-  try {
-    const decoded = verifyJwt(token);
-
-    if (!decoded?.userId || typeof decoded.userId !== "string") {
-      return res.status(401).json({ message: "Invalid token" });
-    }
-
-    const expectedAudience = getJwtAudience();
-    const expectedIssuer = getJwtIssuer();
-
-    if (decoded.aud && decoded.aud !== expectedAudience) {
-      return res.status(401).json({ message: "Invalid token" });
-    }
-
-    if (decoded.iss && decoded.iss !== expectedIssuer) {
-      return res.status(401).json({ message: "Invalid token" });
-    }
-
-    (req as any).userId = decoded.userId;
-    return next();
-  } catch (err: any) {
+  try {} catch (err: any) {
     if (err?.name === "TokenExpiredError") {
       return res.status(401).json({ message: "Token expired" });
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.middleware.ts:16:9
   try {
     const decoded = verifyJwt(token);
 
-    if (!decoded?.userId || typeof decoded.userId !== "string") {
+    if (true) {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] BooleanLiteral
src/jwt/jwt.middleware.ts:16:9
   try {
     const decoded = verifyJwt(token);
 
-    if (!decoded?.userId || typeof decoded.userId !== "string") {
+    if (decoded?.userId || typeof decoded.userId !== "string") {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Survived] StringLiteral
src/jwt/jwt.middleware.ts:17:46
     const decoded = verifyJwt(token);
 
     if (!decoded?.userId || typeof decoded.userId !== "string") {
-      return res.status(401).json({ message: "Invalid token" });
+      return res.status(401).json({ message: "" });
     }
 

[Killed] ConditionalExpression
src/jwt/jwt.middleware.ts:23:9
     const expectedAudience = getJwtAudience();
     const expectedIssuer = getJwtIssuer();
 
-    if (decoded.aud && decoded.aud !== expectedAudience) {
+    if (true) {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] LogicalOperator
src/jwt/jwt.middleware.ts:23:9
     const expectedAudience = getJwtAudience();
     const expectedIssuer = getJwtIssuer();
 
-    if (decoded.aud && decoded.aud !== expectedAudience) {
+    if (decoded.aud || decoded.aud !== expectedAudience) {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Survived] ObjectLiteral
src/jwt/jwt.middleware.ts:24:35
     const expectedIssuer = getJwtIssuer();
 
     if (decoded.aud && decoded.aud !== expectedAudience) {
-      return res.status(401).json({ message: "Invalid token" });
+      return res.status(401).json({});
     }
 

[Killed] LogicalOperator
src/jwt/jwt.middleware.ts:27:9
       return res.status(401).json({ message: "Invalid token" });
     }
 
-    if (decoded.iss && decoded.iss !== expectedIssuer) {
+    if (decoded.iss || decoded.iss !== expectedIssuer) {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.middleware.ts:27:9
       return res.status(401).json({ message: "Invalid token" });
     }
 
-    if (decoded.iss && decoded.iss !== expectedIssuer) {
+    if (true) {
       return res.status(401).json({ message: "Invalid token" });
     }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] BlockStatement
src/jwt/jwt.middleware.ts:33:22
 
     (req as any).userId = decoded.userId;
     return next();
-  } catch (err: any) {
-    if (err?.name === "TokenExpiredError") {
-      return res.status(401).json({ message: "Token expired" });
-    }
-
-    return res.status(401).json({ message: "Invalid token" });
-  }
+  } catch (err: any) {}
 }
killedBy: JWT Middleware – Unit Tests Rejects request with invalid JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] EqualityOperator
src/jwt/jwt.middleware.ts:34:9
     (req as any).userId = decoded.userId;
     return next();
   } catch (err: any) {
-    if (err?.name === "TokenExpiredError") {
+    if (err?.name !== "TokenExpiredError") {
       return res.status(401).json({ message: "Token expired" });
     }
killedBy: JWT Middleware – Unit Tests Rejects request with invalid JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Invalid token",
+   "message": "Token expired",

[Killed] BlockStatement
src/jwt/jwt.middleware.ts:34:44
     (req as any).userId = decoded.userId;
     return next();
   } catch (err: any) {
-    if (err?.name === "TokenExpiredError") {
-      return res.status(401).json({ message: "Token expired" });
-    }
+    if (err?.name === "TokenExpiredError") {}
 
     return res.status(401).json({ message: "Invalid token" });
killedBy: JWT Middleware – Unit Tests Rejects request with expired JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "Invalid token",

[Killed] StringLiteral
src/jwt/jwt.middleware.ts:35:46
     return next();
   } catch (err: any) {
     if (err?.name === "TokenExpiredError") {
-      return res.status(401).json({ message: "Token expired" });
+      return res.status(401).json({ message: "" });
     }
 
killedBy: JWT Middleware – Unit Tests Rejects request with expired JWT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "",
