[Survived] LogicalOperator
src/sessions/sessions.controller.ts:14:31
 export async function loginWithSession(req: Request, res: Response, next: NextFunction) {
   try {
     const variantOverrides = getVariantOverrides();
-    const regenerateOnLogin = variantOverrides.sessions?.regenerateOnLogin ?? true;
+    const regenerateOnLogin = variantOverrides.sessions?.regenerateOnLogin && true;
     const sessionCookieOverride = variantOverrides.sessions?.cookie;
 

[Survived] BooleanLiteral
src/sessions/sessions.controller.ts:14:79
 export async function loginWithSession(req: Request, res: Response, next: NextFunction) {
   try {
     const variantOverrides = getVariantOverrides();
-    const regenerateOnLogin = variantOverrides.sessions?.regenerateOnLogin ?? true;
+    const regenerateOnLogin = variantOverrides.sessions?.regenerateOnLogin ?? false;
     const sessionCookieOverride = variantOverrides.sessions?.cookie;
 

[Survived] StringLiteral
src/sessions/sessions.controller.ts:21:42
 
     const user = await findUserByEmail(email);
     if (!user) {
-      await writeAuditEvent({ eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
+      await writeAuditEvent({ eventType: "", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
       return res.status(401).json({ message: "Invalid credentials" });
     }

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:21:142
 
     const user = await findUserByEmail(email);
     if (!user) {
-      await writeAuditEvent({ eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
+      await writeAuditEvent({ eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: {} });
       return res.status(401).json({ message: "Invalid credentials" });
     }

[Survived] StringLiteral
src/sessions/sessions.controller.ts:22:46
     const user = await findUserByEmail(email);
     if (!user) {
       await writeAuditEvent({ eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { email } });
-      return res.status(401).json({ message: "Invalid credentials" });
+      return res.status(401).json({ message: "" });
     }
 

[Survived] BooleanLiteral
src/sessions/sessions.controller.ts:26:9
     }
 
     const match = await isValidPassword(password, user.password);
-    if (!match) {
+    if (match) {
       await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
       return res.status(401).json({ message: "Invalid credentials" });

[Survived] BlockStatement
src/sessions/sessions.controller.ts:26:17
     }
 
     const match = await isValidPassword(password, user.password);
-    if (!match) {
-      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-      return res.status(401).json({ message: "Invalid credentials" });
-    }
+    if (!match) {}
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);

[Survived] StringLiteral
src/sessions/sessions.controller.ts:27:59
 
     const match = await isValidPassword(password, user.password);
     if (!match) {
-      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
+      await writeAuditEvent({ userId: user.id, eventType: "", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
       return res.status(401).json({ message: "Invalid credentials" });
     }

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:28:35
     const match = await isValidPassword(password, user.password);
     if (!match) {
       await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-      return res.status(401).json({ message: "Invalid credentials" });
+      return res.status(401).json({});
     }
 

[Survived] StringLiteral
src/sessions/sessions.controller.ts:28:46
     const match = await isValidPassword(password, user.password);
     if (!match) {
       await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent") });
-      return res.status(401).json({ message: "Invalid credentials" });
+      return res.status(401).json({ message: "" });
     }
 

[Survived] BlockStatement
src/sessions/sessions.controller.ts:32:20
     }
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);
-    if (!mfaValid) {
-      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
-      return res.status(401).json({ message: "MFA required or invalid code" });
-    }
+    if (!mfaValid) {}
 
     const existingSessionId = req.cookies?.sessionId;

[Survived] StringLiteral
src/sessions/sessions.controller.ts:33:169
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);
     if (!mfaValid) {
-      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
+      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "" } });
       return res.status(401).json({ message: "MFA required or invalid code" });
     }

[Survived] StringLiteral
src/sessions/sessions.controller.ts:33:59
 
     const mfaValid = await validateMfaForUser(user.id, mfaCode);
     if (!mfaValid) {
-      await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
+      await writeAuditEvent({ userId: user.id, eventType: "", outcome: "failure", ipAddress: req.ip, userAgent: req.get("user-agent"), metadata: { reason: "mfa" } });
       return res.status(401).json({ message: "MFA required or invalid code" });
     }

[Survived] OptionalChaining
src/sessions/sessions.controller.ts:37:31
       return res.status(401).json({ message: "MFA required or invalid code" });
     }
 
-    const existingSessionId = req.cookies?.sessionId;
+    const existingSessionId = req.cookies.sessionId;
     if (existingSessionId && regenerateOnLogin) {
       await deleteSession(existingSessionId).catch(() => undefined);

[Survived] ConditionalExpression
src/sessions/sessions.controller.ts:38:9
     }
 
     const existingSessionId = req.cookies?.sessionId;
-    if (existingSessionId && regenerateOnLogin) {
+    if (true) {
       await deleteSession(existingSessionId).catch(() => undefined);
     }

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:38:9
     }
 
     const existingSessionId = req.cookies?.sessionId;
-    if (existingSessionId && regenerateOnLogin) {
+    if (existingSessionId || regenerateOnLogin) {
       await deleteSession(existingSessionId).catch(() => undefined);
     }

[Survived] BooleanLiteral
src/sessions/sessions.controller.ts:42:42
       await deleteSession(existingSessionId).catch(() => undefined);
     }
 
-    const session = existingSessionId && !regenerateOnLogin
+    const session = existingSessionId && regenerateOnLogin
       ? await createSessionWithId(user.id, existingSessionId)
       : await createSession(user.id);

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:42:21
       await deleteSession(existingSessionId).catch(() => undefined);
     }
 
-    const session = existingSessionId && !regenerateOnLogin
+    const session = existingSessionId || !regenerateOnLogin
       ? await createSessionWithId(user.id, existingSessionId)
       : await createSession(user.id);

[Survived] StringLiteral
src/sessions/sessions.controller.ts:46:16
       ? await createSessionWithId(user.id, existingSessionId)
       : await createSession(user.id);
 
-    res.cookie("sessionId", session.id, {
+    res.cookie("", session.id, {
       httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
       secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:47:17
       : await createSession(user.id);
 
     res.cookie("sessionId", session.id, {
-      httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
+      httpOnly: sessionCookieOverride?.httpOnly && APP_CONFIG.cookie.httpOnly,
       secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,
       sameSite: sessionCookieOverride?.sameSite ?? APP_CONFIG.cookie.sameSite,

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:48:15
 
     res.cookie("sessionId", session.id, {
       httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
-      secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,
+      secure: sessionCookieOverride?.secure && APP_CONFIG.cookie.secure,
       sameSite: sessionCookieOverride?.sameSite ?? APP_CONFIG.cookie.sameSite,
       domain: APP_CONFIG.cookie.domain,

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:49:17
     res.cookie("sessionId", session.id, {
       httpOnly: sessionCookieOverride?.httpOnly ?? APP_CONFIG.cookie.httpOnly,
       secure: sessionCookieOverride?.secure ?? APP_CONFIG.cookie.secure,
-      sameSite: sessionCookieOverride?.sameSite ?? APP_CONFIG.cookie.sameSite,
+      sameSite: sessionCookieOverride?.sameSite && APP_CONFIG.cookie.sameSite,
       domain: APP_CONFIG.cookie.domain,
       maxAge: APP_CONFIG.cookie.maxAgeMs,

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:56:33
 
     await writeAuditEvent({ userId: user.id, eventType: "session.login", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
 
-    return res.status(200).json({
-      message: "Session created",
-      user: { id: user.id, email: user.email },
-    });
+    return res.status(200).json({});
   } catch (err) {
     next(err);

[Survived] BlockStatement
src/sessions/sessions.controller.ts:65:66
   }
 }
 
-export async function logoutSession(req: Request, res: Response) {
-  const variantOverrides = getVariantOverrides();
-  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
-  const sessionId = req.cookies.sessionId;
-
-  if (sessionId && invalidateSessionOnLogout) {
-    await deleteSession(sessionId);     // delete from DB
-  }
-
-  res.clearCookie("sessionId", {
-    httpOnly: APP_CONFIG.cookie.httpOnly,
-    secure: APP_CONFIG.cookie.secure,
-    sameSite: APP_CONFIG.cookie.sameSite,
-    domain: APP_CONFIG.cookie.domain,
-  });       // remove cookie
-
-  await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
-
-  return res.json({ message: "Logged out" });
-}
+export async function logoutSession(req: Request, res: Response) {}
 
 export function getSessionProtected(req: Request, res: Response) {

[Survived] LogicalOperator
src/sessions/sessions.controller.ts:67:37
 
 export async function logoutSession(req: Request, res: Response) {
   const variantOverrides = getVariantOverrides();
-  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
+  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout && true;
   const sessionId = req.cookies.sessionId;
 

[Survived] BooleanLiteral
src/sessions/sessions.controller.ts:67:93
 
 export async function logoutSession(req: Request, res: Response) {
   const variantOverrides = getVariantOverrides();
-  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
+  const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? false;
   const sessionId = req.cookies.sessionId;
 

[Survived] ConditionalExpression
src/sessions/sessions.controller.ts:70:7
   const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
   const sessionId = req.cookies.sessionId;
 
-  if (sessionId && invalidateSessionOnLogout) {
+  if (true) {
     await deleteSession(sessionId);     // delete from DB
   }

[Survived] BlockStatement
src/sessions/sessions.controller.ts:70:47
   const invalidateSessionOnLogout = variantOverrides.sessions?.invalidateSessionOnLogout ?? true;
   const sessionId = req.cookies.sessionId;
 
-  if (sessionId && invalidateSessionOnLogout) {
-    await deleteSession(sessionId);     // delete from DB
-  }
+  if (sessionId && invalidateSessionOnLogout) {}
 
   res.clearCookie("sessionId", {

[Survived] StringLiteral
src/sessions/sessions.controller.ts:81:38
     domain: APP_CONFIG.cookie.domain,
   });       // remove cookie
 
-  await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
+  await writeAuditEvent({ eventType: "", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
 
   return res.json({ message: "Logged out" });

[Survived] StringLiteral
src/sessions/sessions.controller.ts:81:114
     domain: APP_CONFIG.cookie.domain,
   });       // remove cookie
 
-  await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
+  await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("") });
 
   return res.json({ message: "Logged out" });

[Survived] StringLiteral
src/sessions/sessions.controller.ts:83:30
 
   await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
 
-  return res.json({ message: "Logged out" });
+  return res.json({ message: "" });
 }
 

[Survived] ObjectLiteral
src/sessions/sessions.controller.ts:83:19
 
   await writeAuditEvent({ eventType: "session.logout", outcome: "success", ipAddress: req.ip, userAgent: req.get("user-agent") });
 
-  return res.json({ message: "Logged out" });
+  return res.json({});
 }
 

[Survived] BlockStatement
src/sessions/sessions.controller.ts:86:66
   return res.json({ message: "Logged out" });
 }
 
-export function getSessionProtected(req: Request, res: Response) {
-  return res.json({
-    message: "Protected route accessed",
-    userId: (req as any).userId, // set by requireSession middleware
-  });
-}
+export function getSessionProtected(req: Request, res: Response) {}

[Survived] StringLiteral
src/sessions/sessions.controller.ts:88:14
 
 export function getSessionProtected(req: Request, res: Response) {
   return res.json({
-    message: "Protected route accessed",
+    message: "",
     userId: (req as any).userId, // set by requireSession middleware
   });
