[Survived] ConditionalExpression
src/jwt/jwt.keys.ts:11:7
 let generatedKeyPair: { privateKey: string; publicKey: string } | null = null;
 
 function getGeneratedKeyPair() {
-  if (!generatedKeyPair) {
+  if (true) {
     const pair = crypto.generateKeyPairSync("rsa", {
       modulusLength: 2048,

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:28:25
 }
 
 function loadPrivateKeyFromConfig() {
-  const privateKeyPem = process.env.JWT_PRIVATE_KEY_PEM ?? APP_CONFIG.jwt.privateKeyPem;
+  const privateKeyPem = process.env.JWT_PRIVATE_KEY_PEM && APP_CONFIG.jwt.privateKeyPem;
   const privateKeyPath = process.env.JWT_PRIVATE_KEY_PATH ?? APP_CONFIG.jwt.privateKeyPath;
 

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:29:26
 
 function loadPrivateKeyFromConfig() {
   const privateKeyPem = process.env.JWT_PRIVATE_KEY_PEM ?? APP_CONFIG.jwt.privateKeyPem;
-  const privateKeyPath = process.env.JWT_PRIVATE_KEY_PATH ?? APP_CONFIG.jwt.privateKeyPath;
+  const privateKeyPath = process.env.JWT_PRIVATE_KEY_PATH && APP_CONFIG.jwt.privateKeyPath;
 
   if (privateKeyPem) {

[Survived] BlockStatement
src/jwt/jwt.keys.ts:31:22
   const privateKeyPem = process.env.JWT_PRIVATE_KEY_PEM ?? APP_CONFIG.jwt.privateKeyPem;
   const privateKeyPath = process.env.JWT_PRIVATE_KEY_PATH ?? APP_CONFIG.jwt.privateKeyPath;
 
-  if (privateKeyPem) {
-    return privateKeyPem;
-  }
+  if (privateKeyPem) {}
 
   if (privateKeyPath) {

[Survived] BlockStatement
src/jwt/jwt.keys.ts:35:23
     return privateKeyPem;
   }
 
-  if (privateKeyPath) {
-    return fs.readFileSync(privateKeyPath, "utf8");
-  }
+  if (privateKeyPath) {}
 
   return getGeneratedKeyPair().privateKey;

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:43:26
 }
 
 function loadPublicKeysFromConfig() {
-  const publicKeysJson = process.env.JWT_PUBLIC_KEYS_JSON ?? APP_CONFIG.jwt.publicKeysJson;
+  const publicKeysJson = process.env.JWT_PUBLIC_KEYS_JSON && APP_CONFIG.jwt.publicKeysJson;
   const activeKeyId = process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId;
 

[Survived] BlockStatement
src/jwt/jwt.keys.ts:46:23
   const publicKeysJson = process.env.JWT_PUBLIC_KEYS_JSON ?? APP_CONFIG.jwt.publicKeysJson;
   const activeKeyId = process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId;
 
-  if (publicKeysJson) {
-    return JSON.parse(publicKeysJson) as Record<string, string>;
-  }
+  if (publicKeysJson) {}
 
   const privateKey = loadPrivateKeyFromConfig();

[Survived] ObjectLiteral
src/jwt/jwt.keys.ts:51:63
   }
 
   const privateKey = loadPrivateKeyFromConfig();
-  const publicKey = crypto.createPublicKey(privateKey).export({ type: "spki", format: "pem" }).toString();
+  const publicKey = crypto.createPublicKey(privateKey).export({}).toString();
   return {
     [activeKeyId]: publicKey,

[Survived] ObjectLiteral
src/jwt/jwt.keys.ts:52:10
 
   const privateKey = loadPrivateKeyFromConfig();
   const publicKey = crypto.createPublicKey(privateKey).export({ type: "spki", format: "pem" }).toString();
-  return {
-    [activeKeyId]: publicKey,
-  };
+  return {};
 }
 

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:58:7
 }
 
 export function getJwtAlgorithm(variantAlgorithm?: Algorithm | "none"): SupportedJwtAlgorithm {
-  if (variantAlgorithm) {
+  if (true) {
     return variantAlgorithm as SupportedJwtAlgorithm;
   }
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Survived] ConditionalExpression
src/jwt/jwt.keys.ts:58:7
 }
 
 export function getJwtAlgorithm(variantAlgorithm?: Algorithm | "none"): SupportedJwtAlgorithm {
-  if (variantAlgorithm) {
+  if (false) {
     return variantAlgorithm as SupportedJwtAlgorithm;
   }

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:62:7
     return variantAlgorithm as SupportedJwtAlgorithm;
   }
 
-  if (process.env.JWT_ALGORITHM) {
+  if (true) {
     return process.env.JWT_ALGORITHM as SupportedJwtAlgorithm;
   }
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Survived] BlockStatement
src/jwt/jwt.keys.ts:62:34
     return variantAlgorithm as SupportedJwtAlgorithm;
   }
 
-  if (process.env.JWT_ALGORITHM) {
-    return process.env.JWT_ALGORITHM as SupportedJwtAlgorithm;
-  }
+  if (process.env.JWT_ALGORITHM) {}
 

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:70:7
     return "RS256";
   }
 
-  if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {
+  if (false) {
     return "HS256";
   }
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid algorithm

[Killed] BlockStatement
src/jwt/jwt.keys.ts:70:62
     return "RS256";
   }
 
-  if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {
-    return "HS256";
-  }
+  if (process.env.JWT_SECRET || APP_CONFIG.jwt.legacySecret) {}
 
   return "RS256";
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid algorithm

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:80:7
 export function getJwtSignContext(variantAlgorithm?: Algorithm | "none") {
   const algorithm = getJwtAlgorithm(variantAlgorithm) as SupportedJwtAlgorithm;
 
-  if (algorithm === "none") {
+  if (true) {
     return {
       algorithm,
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must have a value

[Survived] ConditionalExpression
src/jwt/jwt.keys.ts:80:7
 export function getJwtSignContext(variantAlgorithm?: Algorithm | "none") {
   const algorithm = getJwtAlgorithm(variantAlgorithm) as SupportedJwtAlgorithm;
 
-  if (algorithm === "none") {
+  if (false) {
     return {
       algorithm,

[Killed] BlockStatement
src/jwt/jwt.keys.ts:88:35
     };
   }
 
-  if (algorithm.startsWith("HS")) {
-    return {
-      algorithm,
-      signingKey: process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret,
-      keyId: undefined,
-    };
-  }
+  if (algorithm.startsWith("HS")) {}
 
   return {
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must be a symmetric key when using HS256

[Killed] MethodExpression
src/jwt/jwt.keys.ts:88:7
     };
   }
 
-  if (algorithm.startsWith("HS")) {
+  if (algorithm.endsWith("HS")) {
     return {
       algorithm,
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must be a symmetric key when using HS256

[Killed] ObjectLiteral
src/jwt/jwt.keys.ts:89:12
   }
 
   if (algorithm.startsWith("HS")) {
-    return {
-      algorithm,
-      signingKey: process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret,
-      keyId: undefined,
-    };
+    return {};
   }
 
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: secretOrPrivateKey must have a value

[Killed] LogicalOperator
src/jwt/jwt.keys.ts:91:19
   if (algorithm.startsWith("HS")) {
     return {
       algorithm,
-      signingKey: process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret,
+      signingKey: (process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret) && APP_CONFIG.session.secret,
       keyId: undefined,
     };
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: JsonWebTokenError: invalid signature

[Survived] ObjectLiteral
src/jwt/jwt.keys.ts:96:10
     };
   }
 
-  return {
-    algorithm,
-    signingKey: loadPrivateKeyFromConfig(),
-    keyId: process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId,
-  };
+  return {};
 }
 

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:99:12
   return {
     algorithm,
     signingKey: loadPrivateKeyFromConfig(),
-    keyId: process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId,
+    keyId: process.env.JWT_ACTIVE_KID && APP_CONFIG.jwt.activeKeyId,
   };
 }

[Killed] BlockStatement
src/jwt/jwt.keys.ts:103:68
   };
 }
 
-export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === "none") {
-    return null;
-  }
-
-  if (algorithm.startsWith("HS")) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
-  }
-
-  const publicKeys = loadPublicKeysFromConfig();
-  const activeKeyId = process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId;
-  return publicKeys[keyId ?? activeKeyId] ?? publicKeys[activeKeyId];
-}
+export function getJwtVerifyKey(algorithm: string, keyId?: string) {}
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] EqualityOperator
src/jwt/jwt.keys.ts:104:7
 }
 
 export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === "none") {
+  if (algorithm !== "none") {
     return null;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:104:7
 }
 
 export function getJwtVerifyKey(algorithm: string, keyId?: string) {
-  if (algorithm === "none") {
+  if (true) {
     return null;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.keys.ts:108:7
     return null;
   }
 
-  if (algorithm.startsWith("HS")) {
+  if (false) {
     return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
   }
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] BlockStatement
src/jwt/jwt.keys.ts:108:35
     return null;
   }
 
-  if (algorithm.startsWith("HS")) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
-  }
+  if (algorithm.startsWith("HS")) {}
 
   const publicKeys = loadPublicKeysFromConfig();
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Killed] LogicalOperator
src/jwt/jwt.keys.ts:109:12
   }
 
   if (algorithm.startsWith("HS")) {
-    return process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret ?? APP_CONFIG.session.secret;
+    return (process.env.JWT_SECRET ?? APP_CONFIG.jwt.legacySecret) && APP_CONFIG.session.secret;
   }
 
killedBy: JWT Middleware – Unit Tests Allows request with valid JWT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-123"
Received: undefined

[Survived] LogicalOperator
src/jwt/jwt.keys.ts:114:10
 
   const publicKeys = loadPublicKeysFromConfig();
   const activeKeyId = process.env.JWT_ACTIVE_KID ?? APP_CONFIG.jwt.activeKeyId;
-  return publicKeys[keyId ?? activeKeyId] ?? publicKeys[activeKeyId];
+  return publicKeys[keyId ?? activeKeyId] && publicKeys[activeKeyId];
 }
