[Survived] BooleanLiteral
src/sessions/sessions.routes.ts:11:39
 const router = Router();
 
 // Cookie-based CSRF protection
-const csrfProtection = csrf({ cookie: true });
+const csrfProtection = csrf({ cookie: false });
 
 // Login (no CSRF needed)

[Survived] ObjectLiteral
src/sessions/sessions.routes.ts:11:29
 const router = Router();
 
 // Cookie-based CSRF protection
-const csrfProtection = csrf({ cookie: true });
+const csrfProtection = csrf({});
 
 // Login (no CSRF needed)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:14:13
 const csrfProtection = csrf({ cookie: true });
 
 // Login (no CSRF needed)
-router.post("/login", authLimiter, validateLogin, loginWithSession);
+router.post("", authLimiter, validateLogin, loginWithSession);
 
 // Protected route (DB-backed session)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:17:12
 router.post("/login", authLimiter, validateLogin, loginWithSession);
 
 // Protected route (DB-backed session)
-router.get("/protected", requireSession, getSessionProtected);
+router.get("", requireSession, getSessionProtected);
 
 // Logout (no CSRF needed)

[Survived] StringLiteral
src/sessions/sessions.routes.ts:20:13
 router.get("/protected", requireSession, getSessionProtected);
 
 // Logout (no CSRF needed)
-router.post("/logout", logoutSession);
+router.post("", logoutSession);
 
 

[Survived] BlockStatement
src/sessions/sessions.routes.ts:28:57
 // so these endpoints are not used during backend API testing.
 
 // CSRF token endpoint (frontend would call this)
-router.get("/csrf-token", csrfProtection, (req, res) => {
-  res.json({ csrfToken: req.csrfToken() });
-});
+router.get("/csrf-token", csrfProtection, (req, res) => {});
 
 // CSRF-protected action (requires DB session + valid CSRF token)

[Survived] BlockStatement
src/sessions/sessions.routes.ts:33:80
 });
 
 // CSRF-protected action (requires DB session + valid CSRF token)
-router.post("/protected-action", requireSession, csrfProtection, (req, res) => {
-  res.json({ message: "Protected action completed" });
-});
+router.post("/protected-action", requireSession, csrfProtection, (req, res) => {});
 
 export default router;

[Survived] ObjectLiteral
src/sessions/sessions.routes.ts:34:12
 
 // CSRF-protected action (requires DB session + valid CSRF token)
 router.post("/protected-action", requireSession, csrfProtection, (req, res) => {
-  res.json({ message: "Protected action completed" });
+  res.json({});
 });
 
