[Survived] StringLiteral
src/jwt/jwt.routes.ts:9:13
 
 const router = Router();
 
-router.post("/login", authLimiter, validateLogin, jwtLogin);
+router.post("", authLimiter, validateLogin, jwtLogin);
 router.get("/protected", jwtAuth, jwtProtected);
 
