[Killed] LogicalOperator
src/jwt/jwt.service.ts:9:10
 
 export function getJwtAudience() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.audience || process.env.JWT_AUDIENCE || APP_CONFIG.jwt.audience;
+  return (variantOverrides.jwt?.audience || process.env.JWT_AUDIENCE) && APP_CONFIG.jwt.audience;
 }
 
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: "audience" must be a string or array

[Survived] ConditionalExpression
src/jwt/jwt.service.ts:9:10
 
 export function getJwtAudience() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.audience || process.env.JWT_AUDIENCE || APP_CONFIG.jwt.audience;
+  return false || APP_CONFIG.jwt.audience;
 }
 

[Killed] LogicalOperator
src/jwt/jwt.service.ts:14:10
 
 export function getJwtIssuer() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.issuer || process.env.JWT_ISSUER || APP_CONFIG.jwt.issuer;
+  return (variantOverrides.jwt?.issuer || process.env.JWT_ISSUER) && APP_CONFIG.jwt.issuer;
 }
 
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: "issuer" must be a string

[Survived] LogicalOperator
src/jwt/jwt.service.ts:14:10
 
 export function getJwtIssuer() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.issuer || process.env.JWT_ISSUER || APP_CONFIG.jwt.issuer;
+  return variantOverrides.jwt?.issuer && process.env.JWT_ISSUER || APP_CONFIG.jwt.issuer;
 }
 

[Killed] BlockStatement
src/jwt/jwt.service.ts:17:25
   return variantOverrides.jwt?.issuer || process.env.JWT_ISSUER || APP_CONFIG.jwt.issuer;
 }
 
-function getJwtExpiry() {
-  const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.expiry || process.env.JWT_EXPIRES_IN || APP_CONFIG.jwt.expiresIn;
-}
+function getJwtExpiry() {}
 
 export function generateJwt(userId: string) {
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: "expiresIn" should be a number of seconds or string representing a timespan

[Killed] LogicalOperator
src/jwt/jwt.service.ts:19:10
 
 function getJwtExpiry() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.expiry || process.env.JWT_EXPIRES_IN || APP_CONFIG.jwt.expiresIn;
+  return (variantOverrides.jwt?.expiry || process.env.JWT_EXPIRES_IN) && APP_CONFIG.jwt.expiresIn;
 }
 
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: "expiresIn" should be a number of seconds or string representing a timespan

[Survived] LogicalOperator
src/jwt/jwt.service.ts:19:10
 
 function getJwtExpiry() {
   const variantOverrides = getVariantOverrides();
-  return variantOverrides.jwt?.expiry || process.env.JWT_EXPIRES_IN || APP_CONFIG.jwt.expiresIn;
+  return variantOverrides.jwt?.expiry && process.env.JWT_EXPIRES_IN || APP_CONFIG.jwt.expiresIn;
 }
 

[Killed] ObjectLiteral
src/jwt/jwt.service.ts:25:36
 export function generateJwt(userId: string) {
   const variantOverrides = getVariantOverrides();
   const { algorithm, signingKey, keyId } = getJwtSignContext(variantOverrides.jwt?.algorithm);
-  const signOptions: SignOptions = {
-    expiresIn: getJwtExpiry() as SignOptions["expiresIn"],
-    audience: getJwtAudience(),
-    issuer: getJwtIssuer(),
-    algorithm: algorithm as SignOptions["algorithm"],
-  };
+  const signOptions: SignOptions = {};
 
   if (keyId) {
killedBy: JWT Signing – Unit Tests Token contains standard JWT fields
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/jwt/jwt.service.ts:32:7
     algorithm: algorithm as SignOptions["algorithm"],
   };
 
-  if (keyId) {
+  if (true) {
     signOptions.keyid = keyId;
   }
killedBy: JWT Signing – Unit Tests generateJwt returns a valid signed token
statusReason: Error: "keyid" must be a string

[Survived] BlockStatement
src/jwt/jwt.service.ts:32:14
     algorithm: algorithm as SignOptions["algorithm"],
   };
 
-  if (keyId) {
-    signOptions.keyid = keyId;
-  }
+  if (keyId) {}
 
   if (algorithm === "none") {

[Survived] BlockStatement
src/jwt/jwt.service.ts:36:29
     signOptions.keyid = keyId;
   }
 
-  if (algorithm === "none") {
-    return jwt.sign({ userId }, null as any, {
-      ...signOptions,
-      algorithm: "none",
-    });
-  }
+  if (algorithm === "none") {}
 
   return jwt.sign(

[Survived] BooleanLiteral
src/jwt/jwt.service.ts:51:55
 }
 
 export function verifyJwt(token: string) {
-  const decodedHeader = jwt.decode(token, { complete: true });
+  const decodedHeader = jwt.decode(token, { complete: false });
   const header = typeof decodedHeader === "object" && decodedHeader && "header" in decodedHeader
     ? decodedHeader.header as { alg?: string; kid?: string }

[Survived] ConditionalExpression
src/jwt/jwt.service.ts:52:18
 
 export function verifyJwt(token: string) {
   const decodedHeader = jwt.decode(token, { complete: true });
-  const header = typeof decodedHeader === "object" && decodedHeader && "header" in decodedHeader
+  const header = true && decodedHeader && "header" in decodedHeader
     ? decodedHeader.header as { alg?: string; kid?: string }
     : undefined;

[Survived] StringLiteral
src/jwt/jwt.service.ts:52:72
 
 export function verifyJwt(token: string) {
   const decodedHeader = jwt.decode(token, { complete: true });
-  const header = typeof decodedHeader === "object" && decodedHeader && "header" in decodedHeader
+  const header = typeof decodedHeader === "object" && decodedHeader && "" in decodedHeader
     ? decodedHeader.header as { alg?: string; kid?: string }
     : undefined;

[Survived] BlockStatement
src/jwt/jwt.service.ts:67:54
   }) as unknown as { userId: string; aud?: string; iss?: string };
 }
 
-export async function findUserByEmail(email: string) {
-  return findUserByEmailFromDb(email);
-}
+export async function findUserByEmail(email: string) {}
