[Survived] StringLiteral
src/oauth/oauth.routes.ts:12:13
 router.post("/authorize", oauthLimiter, validateAuthorize, authorize);
 router.post("/token", oauthLimiter, validateToken, token);
 
-router.post("/refresh", oauthLimiter, refresh);
+router.post("", oauthLimiter, refresh);
 router.post("/revoke", oauthLimiter, revoke);
 

[Survived] BlockStatement
src/oauth/oauth.routes.ts:15:59
 router.post("/refresh", oauthLimiter, refresh);
 router.post("/revoke", oauthLimiter, revoke);
 
-router.get("/protected", verifyAccessToken, (req, res) => {
-  return res.json({
-    message: "Protected resource accessed",
-    user_id: (req as any).userId,
-    scope: (req as any).scope
-  });
-});
+router.get("/protected", verifyAccessToken, (req, res) => {});
 
 // Introspection endpoint (also rate‑limited)

[Survived] StringLiteral
src/oauth/oauth.routes.ts:17:14
 
 router.get("/protected", verifyAccessToken, (req, res) => {
   return res.json({
-    message: "Protected resource accessed",
+    message: "",
     user_id: (req as any).userId,
     scope: (req as any).scope
