[Killed] BlockStatement
src/oauth/oauth.service.ts:19:37
 /**
  * Helper to compute expiry timestamps
  */
-function expiresIn(minutes: number) {
-  return new Date(Date.now() + minutes * 60 * 1000);
-}
+function expiresIn(minutes: number) {}
 
 /**
killedBy: OAuth Negative Path Tests POST /oauth/token → rejects non-string code
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] ArithmeticOperator
src/oauth/oauth.service.ts:20:32
  * Helper to compute expiry timestamps
  */
 function expiresIn(minutes: number) {
-  return new Date(Date.now() + minutes * 60 * 1000);
+  return new Date(Date.now() + minutes / 60 * 1000);
 }
 
killedBy: OAuth Negative Path Tests POST /oauth/token → rejects non-string code
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] ArithmeticOperator
src/oauth/oauth.service.ts:20:32
  * Helper to compute expiry timestamps
  */
 function expiresIn(minutes: number) {
-  return new Date(Date.now() + minutes * 60 * 1000);
+  return new Date(Date.now() + minutes * 60 / 1000);
 }
 
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects missing userId
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] BooleanLiteral
src/oauth/oauth.service.ts:33:13
   const claimedCode = await prisma.oAuthAuthorizationCode.updateMany({
     where: {
       code,
-      used: false,
+      used: true,
       expiresAt: { gt: now },
     },
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects userId not found in DB
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] ObjectLiteral
src/oauth/oauth.service.ts:36:11
       used: false,
       expiresAt: { gt: now },
     },
-    data: {
-      used: true,
-    },
+    data: {},
   });
 
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects missing userId
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] BooleanLiteral
src/oauth/oauth.service.ts:37:13
       expiresAt: { gt: now },
     },
     data: {
-      used: true,
+      used: false,
     },
   });
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects userId not found in DB
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] ConditionalExpression
src/oauth/oauth.service.ts:41:7
     },
   });
 
-  if (claimedCode.count !== 1) {
+  if (false) {
     return null;
   }
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects missing userId
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:57:23

  54 });
  55 
  56 // Legacy client used by older tests.
→ 57 await oauthClient.create(

[Killed] BlockStatement
src/oauth/oauth.service.ts:41:32
     },
   });
 
-  if (claimedCode.count !== 1) {
-    return null;
-  }
+  if (claimedCode.count !== 1) {}
 
   const authCode = await prisma.oAuthAuthorizationCode.findUnique({
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects userId not found in DB
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] ArithmeticOperator
src/oauth/oauth.service.ts:62:40
       userId: authCode.userId,
       clientId: authCode.clientId,
       scope: authCode.scope,
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds / 1000),
     },
   });
killedBy: OAuth Negative Path Tests GET /oauth/protected → rejects missing Authorization header
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(

[Killed] ArithmeticOperator
src/oauth/oauth.service.ts:62:27
       userId: authCode.userId,
       clientId: authCode.clientId,
       scope: authCode.scope,
-      expiresAt: new Date(Date.now() + APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
+      expiresAt: new Date(Date.now() - APP_CONFIG.oauth.accessTokenTtlSeconds * 1000),
     },
   });
killedBy: OAuth Negative Path Tests POST /oauth/authorize → rejects userId not found in DB
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] ConditionalExpression
src/oauth/oauth.service.ts:85:7
   });
 
   if (!stored) return null;
-  if (stored.expiresAt < new Date()) return null;
+  if (true) return null;
 
   return stored; // includes scope
killedBy: OAuth scope escalation high-impact rejects multi-scope escalation for basic client
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:40:23

  37   },
  38 });
  39 
→ 40 await oauthClient.create(

[Killed] EqualityOperator
src/oauth/oauth.service.ts:85:7
   });
 
   if (!stored) return null;
-  if (stored.expiresAt < new Date()) return null;
+  if (stored.expiresAt >= new Date()) return null;
 
   return stored; // includes scope
killedBy: OAuth Integration Flow POST /oauth/authorize → returns authorization code for valid user
statusReason: PrismaClientKnownRequestError: 
Invalid `oauthClient.create()` invocation in
C:\Users\jkmag\Development\api-authentication-models-evaluation\.stryker-tmp\sandbox-9yDcQN\tests\setup.ts:32:23

  29 
  30 if (oauthClient?.create) {
  31   // Recreate clients used in tests.
→ 32   await oauthClient.create(
